## SQL Practices

In [1]:
# Load Magic commands
import sqlite3
%load_ext sql

# Load SQLite database
%sql sqlite:///pandp.db

In [2]:
%%sql
SELECT name tables
FROM sqlite_master 
WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' 
ORDER BY 1;

 * sqlite:///pandp.db
Done.

[('V3',),
 ('accounts',),
 ('orders',),
 ('region',),
 ('sales_reps',),
 ('web_events',)]

### order by

In [3]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24)]

In [4]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC, account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

### where

In [5]:
%%sql
SELECT *
FROM orders
WHERE account_id = 4251
ORDER BY occurred_at
LIMIT 1000;

 * sqlite:///pandp.db
Done.

[(6719, 4251, '2016-06-05 01:16:37', 0, 78, 0, 78, 0, 584.22, 0, 584.22),
 (4009, 4251, '2016-06-05 01:36:42', 626, 15, 0, 641, 3123.74, 112.35, 0, 3236.09),
 (4010, 4251, '2016-07-04 12:34:49', 498, 6, 2, 506, 2485.02, 44.94, 16.24, 2546.2),
 (4011, 4251, '2016-08-02 00:53:28', 679, 36, 5, 720, 3388.21, 269.64, 40.6, 3698.45),
 (6720, 4251, '2016-08-02 01:13:08', 9, 0, 19, 28, 44.91, 0, 154.28, 199.19),
 (4012, 4251, '2016-09-01 02:32:51', 503, 13, 32, 548, 2509.97, 97.37, 259.84, 2867.18),
 (6721, 4251, '2016-09-01 02:39:55', 3, 71, 50, 124, 14.97, 531.79, 406, 952.76),
 (4013, 4251, '2016-09-30 13:31:53', 503, 39, 0, 542, 2509.97, 292.11, 0, 2802.08),
 (4014, 4251, '2016-10-29 12:04:06', 483, 12, 0, 495, 2410.17, 89.88, 0, 2500.05),
 (6722, 4251, '2016-11-27 15:16:07', 19, 56, 0, 75, 94.81, 419.44, 0, 514.25),
 (4015, 4251, '2016-11-27 15:17:06', 520, 21, 7, 548, 2594.8, 157.29, 56.84, 2808.93),
 (6723, 4251, '2016-12-26 08:39:56', 0, 31, 21, 52, 0, 232.19, 170.52, 402.71),
 (4016, 4251, '2016-12-26 08:53:24', 521, 16, 28262, 28799, 2599.79, 119.84, 229487.44, 232207.07)]

In [6]:
%%sql
SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

In [7]:
%%sql
SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0, 0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0, 0, 0, 0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0, 0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0, 479.36, 0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0, 0, 16.24, 16.24)]

In [8]:
%%sql
SELECT *
FROM accounts
WHERE name = 'United Technologies'

 * sqlite:///pandp.db
Done.

[(1441, 'United Technologies', 'www.utc.com', 42.329397, -75.15785469, 'Janett Wisecarver', 321520)]

In [9]:
%%sql
SELECT *
FROM accounts
WHERE name != 'United Technologies'
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [10]:
%%sql
SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Mobil'

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

### Arthmetic

In [11]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty + poster_qty AS nonstandard_qty
FROM orders
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 123, 46),
 (1001, '2015-11-05 03:34:33', 190, 98),
 (1001, '2015-12-04 04:21:55', 85, 47),
 (1001, '2016-01-02 01:18:24', 144, 32),
 (1001, '2016-02-01 19:27:27', 108, 57)]

In [12]:
%%sql
SELECT id, account_id, standard_amt_usd/standard_qty AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 4.99),
 (2, 1001, 4.99),
 (3, 1001, 4.989999999999999),
 (4, 1001, 4.989999999999999),
 (5, 1001, 4.989999999999999),
 (6, 1001, 4.99),
 (7, 1001, 4.99),
 (8, 1001, 4.99),
 (9, 1001, 4.989999999999999),
 (10, 1001, 4.99)]

In [13]:
%%sql
SELECT id, account_id, 
poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 0.20019929527546923),
 (2, 1001, 0.269401582044551),
 (3, 1001, 0.0),
 (4, 1001, 0.0),
 (5, 1001, 0.23117672777557474),
 (6, 1001, 0.349983602717264),
 (7, 1001, 0.49862501668669074),
 (8, 1001, 0.5974661339050775),
 (9, 1001, 0.23737326760301367),
 (10, 1001, 0.07393917319249681)]

### like

In [14]:
%%sql
SELECT *
FROM accounts
WHERE website LIKE '%google%';

 * sqlite:///pandp.db
Done.

[(1351, 'Alphabet', 'www.google.com', 40.20427811, -75.07724145, 'Pamula Hammel', 321640)]

In [15]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE 'C%';

 * sqlite:///pandp.db
Done.

[('CVS Health',),
 ('Chevron',),
 ('Costco',),
 ('Cardinal Health',),
 ('Citigroup',),
 ('Comcast',),
 ('Cisco Systems',),
 ('Caterpillar',),
 ('Coca-Cola',),
 ('Cigna',),
 ('CHS',),
 ('ConocoPhillips',),
 ('Capital One Financial',),
 ('Centene',),
 ('Community Health Systems',),
 ('Cummins',),
 ('CenturyLink',),
 ('Colgate-Palmolive',),
 ('ConAgra Foods',),
 ('CarMax',),
 ('CBS',),
 ('C.H. Robinson Worldwide',),
 ('CDW',),
 ('Chesapeake Energy',),
 ('Consolidated Edison',),
 ('Cognizant Technology Solutions',),
 ('Computer Sciences',),
 ('CSX',),
 ('CBRE Group',),
 ('Charter Communications',),
 ('CST Brands',),
 ('Celgene',),
 ('Corning',),
 ('Core-Mark Holding',),
 ('Cameron International',),
 ('Crown Holdings',),
 ('Campbell Soup',)]

In [16]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%one%';

 * sqlite:///pandp.db
Done.

[('Honeywell International',),
 ('INTL FCStone',),
 ('Capital One Financial',),
 ('AutoZone',),
 ('Oneok',)]

In [17]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('Cisco Systems',)]

## In

In [18]:
%%sql
SELECT *
FROM orders
WHERE account_id IN (1001,1021)
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [19]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom');

 * sqlite:///pandp.db
Done.

[('Walmart', 'Tamara Tuma', 321500),
 ('Target', 'Luba Streett', 321660),
 ('Nordstrom', 'Yan Crater', 321820)]

### Not

In [20]:
%%sql
SELECT sales_rep_id, 
       name
FROM accounts
WHERE sales_rep_id NOT IN (321500,321570)
ORDER BY sales_rep_id
limit 5;

 * sqlite:///pandp.db
Done.

[(321510, 'Exxon Mobil'),
 (321510, 'J.P. Morgan Chase'),
 (321510, 'PepsiCo'),
 (321510, 'Energy Transfer Equity'),
 (321510, 'Delta Air Lines')]

In [21]:
%%sql
SELECT *
FROM accounts
WHERE website NOT LIKE '%com%';

 * sqlite:///pandp.db
Done.

[(1811, 'TIAA', 'www.tiaa.org', 42.3595683, -71.05133234, 'Deeanna Burpo', 321640),
 (2241, 'Community Health Systems', 'www.chs.net', 41.87567906, -87.63221831, 'Grazyna Dewald', 321710)]

In [22]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
limit 5;

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'Sung Shields', 321510),
 ('Apple', 'Jodee Lupo', 321520),
 ('Berkshire Hathaway', 'Serafina Banda', 321530),
 ('McKesson', 'Angeles Crusoe', 321540),
 ('UnitedHealth Group', 'Savanna Gayman', 321550)]

In [23]:
%%sql
SELECT *
FROM web_events
WHERE channel NOT IN ('organic', 'adwords')
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:13:58', 'direct'),
 (2, 1001, '2015-11-05 03:08:26', 'direct'),
 (3, 1001, '2015-12-04 03:57:24', 'direct'),
 (4, 1001, '2016-01-02 00:55:03', 'direct'),
 (5, 1001, '2016-02-01 19:02:33', 'direct')]

In [24]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

### AND & Between

In [25]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-04-01' AND occurred_at <= '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [26]:
%%sql
SELECT *
FROM orders
WHERE occurred_at BETWEEN '2016-04-01' AND '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [27]:
%%sql
SELECT *
FROM orders
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;

 * sqlite:///pandp.db
Done.

[(2613, 2951, '2016-08-15 00:06:12', 1171, 0, 0, 1171, 5843.29, 0, 0, 5843.29),
 (3260, 3491, '2014-08-29 22:43:00', 1552, 0, 0, 1552, 7744.48, 0, 0, 7744.48)]

In [28]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%' AND name LIKE '%s'
limit 4;

 * sqlite:///pandp.db
Done.

[('General Motors',), ('United Technologies',), ("Lowe's",), ('UPS',)]

In [29]:
%%sql
SELECT *
FROM web_events
WHERE channel IN ('organic', 'adwords') AND occurred_at BETWEEN '2016-01-01' AND '2017-01-01'
ORDER BY occurred_at DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(8493, 4141, '2016-12-31 16:31:23', 'organic'),
 (5661, 1851, '2016-12-31 06:55:38', 'organic'),
 (5562, 1791, '2016-12-31 02:08:50', 'adwords'),
 (7703, 3351, '2016-12-30 21:06:53', 'adwords'),
 (7921, 3521, '2016-12-30 20:15:48', 'organic')]

### or

In [30]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-12-04 04:21:55', 85, 47, 0),
 (1001, '2016-01-02 01:18:24', 144, 32, 0),
 (1001, '2016-07-30 03:26:30', 101, 36, 0),
 (1011, '2016-12-21 10:59:34', 527, 14, 0),
 (1021, '2015-10-12 02:21:56', 516, 23, 0)]

In [31]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty,
       poster_qty
FROM orders
WHERE (standard_qty = 0 OR gloss_qty = 0 OR poster_qty = 0)
AND occurred_at = '2016-10-01'

 * sqlite:///pandp.db
Done.

[]

In [32]:
%%sql
SELECT id
FROM orders
WHERE gloss_qty > 4000 OR poster_qty > 4000
limit 5;

 * sqlite:///pandp.db
Done.

[(362,), (731,), (1191,), (1913,), (1939,)]

In [33]:
%%sql
SELECT *
FROM orders
WHERE standard_qty = 0 AND (gloss_qty > 1000 OR poster_qty > 1000);

 * sqlite:///pandp.db
Done.

[(1913, 2461, '2013-12-29 09:50:38', 0, 6450, 45, 6495, 0, 48310.5, 365.4, 48675.9),
 (4369, 1111, '2015-11-15 17:47:46', 0, 486, 2988, 3474, 0, 3640.14, 24262.56, 27902.7),
 (4391, 1161, '2016-06-04 08:58:10', 0, 106, 2967, 3073, 0, 793.94, 24092.04, 24885.98),
 (4420, 1191, '2016-05-21 23:21:14', 0, 43, 1448, 1491, 0, 322.07, 11757.76, 12079.83),
 (4448, 1231, '2016-06-25 12:27:15', 0, 3178, 23, 3201, 0, 23803.22, 186.76, 23989.98),
 (4698, 1451, '2015-02-26 06:13:21', 0, 484, 4901, 5385, 0, 3625.16, 39796.12, 43421.28),
 (4942, 1701, '2015-09-24 21:02:25', 0, 10744, 95, 10839, 0, 80472.56, 771.4, 81243.96),
 (5032, 1831, '2016-05-26 17:48:19', 0, 1448, 287, 1735, 0, 10845.52, 2330.44, 13175.96),
 (5191, 2051, '2015-05-17 14:17:59', 0, 1041, 0, 1041, 0, 7797.09, 0, 7797.09),
 (5791, 2861, '2014-10-24 12:06:22', 0, 10, 11691, 11701, 0, 74.9, 94930.92, 95005.82),
 (5805, 2861, '2016-09-29 04:51:11', 0, 60, 3122, 3182, 0, 449.4, 25350.64, 25800.04),
 (5895, 2931, '2016-01-18 09:21:18', 0, 519, 1315, 1834, 0, 3887.31, 10677.8, 14565.11),
 (5933, 3001, '2016-09-14 05:44:07', 0, 2802, 63, 2865, 0, 20986.98, 511.56, 21498.54),
 (6007, 3141, '2013-12-08 20:13:49', 0, 49, 1401, 1450, 0, 367.01, 11376.12, 11743.13),
 (6142, 3341, '2016-11-26 06:56:12', 0, 492, 1947, 2439, 0, 3685.08, 15809.64, 19494.72),
 (6285, 3491, '2015-02-22 09:54:25', 0, 1246, 0, 1246, 0, 9332.54, 0, 9332.54),
 (6332, 3571, '2016-09-18 15:30:41', 0, 51, 1752, 1803, 0, 381.99, 14226.24, 14608.23)]

In [34]:
%%sql
SELECT *
FROM accounts
WHERE (name LIKE 'C%' OR name LIKE 'W%') 
           AND ((primary_poc LIKE '%ana%' OR primary_poc LIKE '%Ana%') 
           AND primary_poc NOT LIKE '%eana%');

 * sqlite:///pandp.db
Done.

[(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560),
 (1361, 'Comcast', 'www.comcastcorporation.com', 42.54154764, -76.24992387, 'Shana Sanborn', 321650)]

### SQL Joins

In [35]:
%%sql
SELECT orders.*,
       accounts.*
FROM orders 
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [36]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [37]:
%%sql
SELECT accounts.name, orders.occurred_at
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart', '2015-10-06 17:31:14'),
 ('Walmart', '2015-11-05 03:34:33'),
 ('Walmart', '2015-12-04 04:21:55'),
 ('Walmart', '2016-01-02 01:18:24'),
 ('Walmart', '2016-02-01 19:27:27')]

In [38]:
%%sql
SELECT orders.standard_qty, orders.gloss_qty, 
 orders.poster_qty,  accounts.website, 
 accounts.primary_poc
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(123, 22, 24, 'www.walmart.com', 'Tamara Tuma'),
 (190, 41, 57, 'www.walmart.com', 'Tamara Tuma'),
 (85, 47, 0, 'www.walmart.com', 'Tamara Tuma'),
 (144, 32, 0, 'www.walmart.com', 'Tamara Tuma'),
 (108, 29, 28, 'www.walmart.com', 'Tamara Tuma')]

In [39]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

### Alias

In [40]:
%%sql
SELECT o.*, a.*
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [41]:
%%sql
SELECT a.primary_poc, w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE a.name = 'Walmart';

 * sqlite:///pandp.db
Done.

[('Tamara Tuma', '2015-10-06 04:22:11', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2015-10-06 17:13:58', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 05:02:47', 'organic', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 14:04:20', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 03:08:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 17:18:54', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-04 03:57:24', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-11 08:44:16', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-01 15:45:54', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-01-02 00:55:03', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-13 19:31:14', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-01 19:02:33', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-07 17:44:10', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-02-27 15:27:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-03-02 15:15:22', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-03-17 19:54:58', 'twitter', 'Walmart'),
 ('Tamara Tuma', '2016-04-01 10:58:55', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-04-05 03:02:52', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-04-17 16:41:02', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 14:26:40', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 15:26:44', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-07 02:28:31', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-05-21 16:22:01', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-05-31 20:53:47', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-06-02 04:41:31', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2016-06-22 13:48:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-06-30 12:09:45', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-12 22:43:02', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 11:29:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-07-26 21:08:52', 'banner', 'Walmart'),
 ('Tamara Tuma', '2016-07-30 03:06:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-08-12 09:31:22', 'organic', 'Walmart'),
 ('Tamara Tuma', '2016-08-28 06:42:42', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-01 18:33:56', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-09-11 17:06:53', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-09-26 23:14:59', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-10-26 20:21:09', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-11-25 22:52:29', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-12-24 05:35:14', 'direct', 'Walmart')]

In [42]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
ORDER BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('Southeast', 'Moon Torian', 'AECOM'),
 ('Southeast', 'Calvin Ollison', 'AES'),
 ('Northeast', 'Elba Felder', 'AIG')]

In [43]:
%%sql
SELECT r.name region, a.name account, 
    o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.833423765599567),
 ('Northeast', 'Walmart', 5.879706082872509),
 ('Northeast', 'Walmart', 5.646522151667762),
 ('Northeast', 'Walmart', 5.935815147625161),
 ('Northeast', 'Walmart', 6.0194924371875205)]

### left & Right Joins

In [44]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [45]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
LEFT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

In [46]:
%%sql
SELECT a.id, a.name, o.total
FROM orders o
RIGHT JOIN accounts a
ON o.account_id = a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 169),
 (1001, 'Walmart', 288),
 (1001, 'Walmart', 132),
 (1001, 'Walmart', 176),
 (1001, 'Walmart', 165)]

### Joins & Filtering

In [47]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
WHERE accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [48]:
%%sql
SELECT orders.*, accounts.*
FROM orders
LEFT JOIN accounts
ON orders.account_id = accounts.id 
AND accounts.sales_rep_id = 321500
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49, 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [49]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 5.965174820318739),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 6.1687185711808565)]

In [50]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'State Farm Insurance Cos.', 5.119282250254291),
 ('Southeast', 'DISH Network', 5.231815847540363),
 ('Northeast', 'Travelers Cos.', 5.2351813313106526),
 ('Northeast', 'Best Buy', 5.260426437930026),
 ('West', 'Stanley Black & Decker', 5.266395560073999)]

In [51]:
%%sql
SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price DESC
limit 5;

 * sqlite:///pandp.db
Done.

[('Northeast', 'IBM', 8.089906082278144),
 ('West', 'Mosaic', 8.066329210358129),
 ('West', 'Pacific Life', 8.063022652514793),
 ('Northeast', 'CHS', 8.018849326780114),
 ('West', 'Fidelity National Financial', 7.9928024668468325)]

In [52]:
%%sql
SELECT DISTINCT a.name, w.channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.id = '1001';

 * sqlite:///pandp.db
Done.

[('Walmart', 'adwords'),
 ('Walmart', 'banner'),
 ('Walmart', 'direct'),
 ('Walmart', 'facebook'),
 ('Walmart', 'organic'),
 ('Walmart', 'twitter')]

In [53]:
%%sql
SELECT o.occurred_at, a.name, o.total, o.total_amt_usd
FROM accounts a
JOIN orders o
ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '01-01-2015' AND '01-01-2016'
ORDER BY o.occurred_at DESC;

 * sqlite:///pandp.db
Done.

[]

## Agregate functions

In [54]:
%%sql
SELECT *
FROM accounts
WHERE id > 1500 and id < 1600

 * sqlite:///pandp.db
Done.

[(1501, 'Intel', 'www.intel.com', 41.03153857, -74.66846407, 'Elouise Beyers', 321580),
 (1511, 'Humana', 'www.humana.com', 41.43233665, -77.00496342, 'Bettye Close', 321590),
 (1521, 'Disney', 'www.disney.com', 41.87879976, -74.81102607, 'Timika Mistretta', 321600),
 (1531, 'Cisco Systems', 'www.cisco.com', 41.20101093, -76.53824668, 'Deadra Waggener', 321610),
 (1541, 'Pfizer', 'www.pfizer.com', 40.69325986, -75.79453197, 'Olevia Taubman', 321620),
 (1551, 'Dow Chemical', 'www.dow.com', 40.53050671, -74.66656358, 'Lillia Ogden', 321630),
 (1561, 'Sysco', 'www.sysco.com', 40.76252413, -73.97753022, 'Julia Laracuente', 321640),
 (1571, 'FedEx', 'www.fedex.com', 40.75290524, -73.97519248, 'Keren Mcconn', 321650),
 (1581, 'Caterpillar', 'www.caterpillar.com', 40.74789383, -73.97738651, 'Latia Beene', 321660),
 (1591, 'Lockheed Martin', 'www.lockheedmartin.com', 40.75497089, -73.98233134, 'Jared Aikins', 321670)]

In [55]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc = NULL

 * sqlite:///pandp.db
Done.

[]

In [56]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NOT NULL
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [57]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL

 * sqlite:///pandp.db
Done.

[]

### count

In [58]:
%%sql
SELECT COUNT(*)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]

In [59]:
%%sql
SELECT COUNT(accounts.id)
FROM accounts;

 * sqlite:///pandp.db
Done.

[(351,)]

In [60]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'
limit 5;

 * sqlite:///pandp.db
Done.

[(16, 1001, '2016-12-24 05:53:13', 123, 127, 19, 269, 613.77, 951.23, 154.28, 1719.28),
 (17, 1011, '2016-12-21 10:59:34', 527, 14, 0, 541, 2629.73, 104.86, 0, 2734.59),
 (24, 1031, '2016-12-25 03:54:27', 1148, 0, 215, 1363, 5728.52, 0, 1745.8, 7474.32),
 (27, 1041, '2016-12-12 07:50:01', 157, 34, 21, 212, 783.43, 254.66, 170.52, 1208.61),
 (33, 1051, '2016-12-30 08:45:43', 495, 1, 1, 497, 2470.05, 7.49, 8.12, 2485.66)]

In [61]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'

 * sqlite:///pandp.db
Done.

[(463,)]

In [62]:
%%sql
SELECT COUNT(*) AS order_count
FROM orders
WHERE occurred_at >= '2016-12-01'
AND occurred_at < '2017-01-01'

 * sqlite:///pandp.db
Done.

[(463,)]

In [63]:
%%sql
SELECT COUNT(primary_poc) AS account_primary_poc_count
FROM accounts

 * sqlite:///pandp.db
Done.

[(351,)]

In [64]:
%%sql
SELECT *
FROM accounts
WHERE primary_poc IS NULL

 * sqlite:///pandp.db
Done.

[]

### sum

In [65]:
%%sql
SELECT SUM(standard_qty) AS standard,
       SUM(gloss_qty) AS gloss,
       SUM(poster_qty) AS poster
FROM orders

 * sqlite:///pandp.db
Done.

[(1938346, 1013773, 723646)]

In [66]:
%%sql
SELECT SUM(poster_qty) AS total_poster_sales
FROM orders;

 * sqlite:///pandp.db
Done.

[(723646,)]

In [67]:
%%sql
SELECT standard_amt_usd + gloss_amt_usd AS total_standard_gloss
FROM orders
limit 4;

 * sqlite:///pandp.db
Done.

[(778.55,), (1255.19,), (776.18,), (958.24,)]

In [68]:
%%sql
SELECT SUM(standard_amt_usd)/SUM(standard_qty) AS standard_price_per_unit
FROM orders;

 * sqlite:///pandp.db
Done.

[(4.990000000000011,)]

In [69]:
%%sql
SELECT MIN(standard_qty) AS standard_min,
       MIN(gloss_qty) AS gloss_min,
       MIN(poster_qty) AS poster_min,
       MAX(standard_qty) AS standard_max,
       MAX(gloss_qty) AS gloss_max,
       MAX(poster_qty) AS poster_max
FROM   orders

 * sqlite:///pandp.db
Done.

[(0, 0, 0, 22591, 14281, 28262)]

## average

In [70]:
%%sql
SELECT AVG(standard_qty) AS standard_avg,
       AVG(gloss_qty) AS gloss_avg,
       AVG(poster_qty) AS poster_avg
FROM orders

 * sqlite:///pandp.db
Done.

[(280.43200231481484, 146.6685474537037, 104.6941550925926)]

In [71]:
%%sql
SELECT MAX(occurred_at)
FROM web_events;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09',)]

In [72]:
%%sql
SELECT occurred_at
FROM web_events
ORDER BY occurred_at DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09',)]

In [73]:
%%sql
SELECT AVG(standard_qty) mean_standard, AVG(gloss_qty) mean_gloss, 
        AVG(poster_qty) mean_poster, AVG(standard_amt_usd) mean_standard_usd, 
        AVG(gloss_amt_usd) mean_gloss_usd, AVG(poster_amt_usd) mean_poster_usd
FROM orders;

 * sqlite:///pandp.db
Done.

[(280.43200231481484, 146.6685474537037, 104.6941550925926, 1399.3556915509291, 1098.547420428239, 850.1165393518496)]

In [74]:
%%sql
SELECT *
FROM (SELECT total_amt_usd
   FROM orders
   ORDER BY total_amt_usd
   LIMIT 3457) AS Table1
ORDER BY total_amt_usd DESC
LIMIT 2;

 * sqlite:///pandp.db
Done.

[(2483.16,), (2482.55,)]

## Group By

In [75]:
%%sql
SELECT account_id,
       SUM(standard_qty) AS standard,
       SUM(gloss_qty) AS gloss,
       SUM(poster_qty) AS poster
FROM orders
GROUP BY account_id
ORDER BY account_id
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 7896, 7831, 3197),
 (1011, 527, 14, 0),
 (1021, 3152, 483, 175),
 (1031, 1148, 0, 215),
 (1041, 836, 770, 646)]

In [76]:
%%sql
SELECT a.name, o.occurred_at
FROM accounts a
JOIN orders o
ON a.id = o.account_id
ORDER BY occurred_at
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('DISH Network', '2013-12-04 04:22:44')]

In [77]:
%%sql
SELECT a.name, SUM(total_amt_usd) total_sales
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('3M', 127945.1),
 ('ADP', 163579.18),
 ('AECOM', 18491.510000000002),
 ('AES', 13038.64),
 ('AIG', 9980.929999999998)]

In [78]:
%%sql
SELECT w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id 
ORDER BY w.occurred_at DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('2017-01-01 23:51:09', 'organic', 'Molina Healthcare')]

In [79]:
%%sql
SELECT w.channel, COUNT(*)
FROM web_events w
GROUP BY w.channel

 * sqlite:///pandp.db
Done.

[('adwords', 906),
 ('banner', 476),
 ('direct', 5298),
 ('facebook', 967),
 ('organic', 952),
 ('twitter', 474)]

In [80]:
%%sql
SELECT a.primary_poc
FROM web_events w
JOIN accounts a
ON a.id = w.account_id
ORDER BY w.occurred_at
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('Leana Hawker',)]

In [81]:
%%sql
SELECT a.name, MIN(total_amt_usd) smallest_order
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
ORDER BY smallest_order
limit 5;

 * sqlite:///pandp.db
Done.

[('BlackRock', 0),
 ('Boeing', 0),
 ('Chevron', 0),
 ('Citigroup', 0),
 ('Disney', 0)]

In [82]:
%%sql
SELECT account_id,
       channel,
       COUNT(id) as events
FROM web_events
GROUP BY account_id, channel
ORDER BY account_id, channel
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'adwords', 5),
 (1001, 'banner', 3),
 (1001, 'direct', 22),
 (1001, 'facebook', 2),
 (1001, 'organic', 6)]

In [83]:
%%sql
SELECT account_id,
       channel,
       COUNT(id) as events
FROM web_events
GROUP BY account_id, channel
ORDER BY account_id, channel DESC
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'twitter', 1),
 (1001, 'organic', 6),
 (1001, 'facebook', 2),
 (1001, 'direct', 22),
 (1001, 'banner', 3)]

In [84]:
%%sql
SELECT a.name, AVG(o.standard_qty) avg_stand, AVG(o.gloss_qty) avg_gloss, AVG(o.poster_qty) avg_post
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('3M', 313.39285714285717, 279.75, 112.10714285714286),
 ('ADP', 354.6333333333333, 60.53333333333333, 61.983333333333334),
 ('AECOM', 363.77777777777777, 13.88888888888889, 16.666666666666668),
 ('AES', 254.66666666666666, 304.0, 98.33333333333333),
 ('AIG', 300.5, 349.0, 108.0)]

In [85]:
%%sql
SELECT a.name, AVG(o.standard_amt_usd) avg_stand, AVG(o.gloss_amt_usd) avg_gloss, AVG(o.poster_amt_usd) avg_post
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.name
limit 5;

 * sqlite:///pandp.db
Done.

[('3M', 1563.8303571428569, 2095.3275, 910.3100000000001),
 ('ADP', 1769.6203333333335, 453.3946666666667, 503.30466666666666),
 ('AECOM', 1815.2511111111112, 104.02777777777777, 135.33333333333334),
 ('AES', 1270.7866666666666, 2276.9599999999996, 798.4666666666667),
 ('AIG', 1499.495, 2614.0099999999998, 876.96)]

In [86]:
%%sql
SELECT s.name, w.channel, COUNT(*) num_events
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.name, w.channel
ORDER BY num_events DESC;

 * sqlite:///pandp.db
Done.

[('Earlie Schleusner', 'direct', 234),
 ('Vernita Plump', 'direct', 232),
 ('Moon Torian', 'direct', 194),
 ('Georgianna Chisholm', 'direct', 188),
 ('Tia Amato', 'direct', 185),
 ('Maren Musto', 'direct', 184),
 ('Nelle Meaux', 'direct', 179),
 ('Maryanna Fiorentino', 'direct', 168),
 ('Dorotha Seawell', 'direct', 161),
 ('Charles Bidwell', 'direct', 159),
 ('Sibyl Lauria', 'direct', 147),
 ('Elna Condello', 'direct', 146),
 ('Micha Woodford', 'direct', 145),
 ('Michel Averette', 'direct', 145),
 ('Delilah Krum', 'direct', 144),
 ('Elwood Shutt', 'direct', 141),
 ('Arica Stoltzfus', 'direct', 140),
 ('Gianna Dossey', 'direct', 140),
 ('Calvin Ollison', 'direct', 139),
 ('Hilma Busick', 'direct', 137),
 ('Brandie Riva', 'direct', 132),
 ('Cliff Meints', 'direct', 122),
 ('Necole Victory', 'direct', 109),
 ('Julia Behrman', 'direct', 102),
 ('Samuel Racine', 'direct', 99),
 ('Dawna Agnew', 'direct', 91),
 ('Saran Ram', 'direct', 86),
 ('Eugena Esser', 'direct', 85),
 ('Debroah Wardle', 'direct', 83),
 ('Derrick Boggess', 'direct', 80),
 ('Ayesha Monica', 'direct', 70),
 ('Cordell Rieder', 'direct', 67),
 ('Marquetta Laycock', 'direct', 66),
 ('Ernestine Pickron', 'direct', 65),
 ('Shawanda Selke', 'direct', 64),
 ('Babette Soukup', 'direct', 59),
 ('Renetta Carew', 'direct', 58),
 ('Carletta Kosinski', 'direct', 54),
 ('Elba Felder', 'direct', 54),
 ('Akilah Drinkard', 'direct', 53),
 ('Maryanna Fiorentino', 'adwords', 53),
 ('Lavera Oles', 'direct', 52),
 ('Sherlene Wetherington', 'direct', 50),
 ('Maren Musto', 'organic', 49),
 ('Retha Sears', 'direct', 49),
 ('Chau Rowles', 'direct', 48),
 ('Soraya Fulton', 'direct', 46),
 ('Maren Musto', 'facebook', 44),
 ('Tia Amato', 'facebook', 43),
 ('Vernita Plump', 'adwords', 43),
 ('Cara Clarke', 'direct', 42),
 ('Silvana Virden', 'direct', 42),
 ('Maryanna Fiorentino', 'facebook', 41),
 ('Vernita Plump', 'organic', 40),
 ('Elna Condello', 'facebook', 39),
 ('Moon Torian', 'facebook', 38),
 ('Maryanna Fiorentino', 'organic', 37),
 ('Dorotha Seawell', 'organic', 36),
 ('Earlie Schleusner', 'facebook', 36),
 ('Vernita Plump', 'facebook', 36),
 ('Maren Musto', 'adwords', 35),
 ('Arica Stoltzfus', 'organic', 34),
 ('Moon Torian', 'organic', 34),
 ('Tia Amato', 'organic', 34),
 ('Micha Woodford', 'facebook', 33),
 ('Arica Stoltzfus', 'facebook', 32),
 ('Delilah Krum', 'organic', 32),
 ('Dorotha Seawell', 'facebook', 32),
 ('Earlie Schleusner', 'organic', 31),
 ('Elna Condello', 'organic', 31),
 ('Moon Torian', 'adwords', 31),
 ('Michel Averette', 'facebook', 30),
 ('Nelle Meaux', 'adwords', 30),
 ('Arica Stoltzfus', 'adwords', 29),
 ('Delilah Krum', 'facebook', 29),
 ('Hilma Busick', 'organic', 29),
 ('Georgianna Chisholm', 'organic', 28),
 ('Julie Starr', 'direct', 28),
 ('Nelle Meaux', 'organic', 28),
 ('Brandie Riva', 'organic', 27),
 ('Charles Bidwell', 'facebook', 27),
 ('Tia Amato', 'adwords', 27),
 ('Debroah Wardle', 'facebook', 26),
 ('Earlie Schleusner', 'adwords', 26),
 ('Elna Condello', 'adwords', 26),
 ('Gianna Dossey', 'adwords', 26),
 ('Saran Ram', 'adwords', 26),
 ('Sibyl Lauria', 'facebook', 26),
 ('Brandie Riva', 'facebook', 25),
 ('Dorotha Seawell', 'adwords', 25),
 ('Gianna Dossey', 'facebook', 25),
 ('Michel Averette', 'organic', 25),
 ('Saran Ram', 'facebook', 25),
 ('Brandie Riva', 'adwords', 24),
 ('Dawna Agnew', 'adwords', 24),
 ('Delilah Krum', 'adwords', 24),
 ('Georgianna Chisholm', 'adwords', 24),
 ('Kathleen Lalonde', 'direct', 24),
 ('Micha Woodford', 'organic', 24),
 ('Michel Averette', 'adwords', 24),
 ('Saran Ram', 'organic', 24),
 ('Cliff Meints', 'facebook', 23),
 ('Earlie Schleusner', 'banner', 23),
 ('Elwood Shutt', 'adwords', 23),
 ('Micha Woodford', 'banner', 23),
 ('Sibyl Lauria', 'adwords', 23),
 ('Ayesha Monica', 'organic', 22),
 ('Calvin Ollison', 'facebook', 22),
 ('Hilma Busick', 'facebook', 22),
 ('Julia Behrman', 'organic', 22),
 ('Micha Woodford', 'adwords', 22),
 ('Necole Victory', 'adwords', 22),
 ('Nelle Meaux', 'facebook', 22),
 ('Calvin Ollison', 'adwords', 21),
 ('Calvin Ollison', 'organic', 21),
 ('Cliff Meints', 'adwords', 21),
 ('Cliff Meints', 'organic', 21),
 ('Delilah Krum', 'twitter', 21),
 ('Hilma Busick', 'adwords', 21),
 ('Maren Musto', 'twitter', 21),
 ('Dawna Agnew', 'facebook', 20),
 ('Derrick Boggess', 'adwords', 20),
 ('Elwood Shutt', 'organic', 20),
 ('Ernestine Pickron', 'adwords', 20),
 ('Sibyl Lauria', 'organic', 20),
 ('Dawna Agnew', 'organic', 19),
 ('Elba Felder', 'organic', 19),
 ('Eugena Esser', 'organic', 19),
 ('Gianna Dossey', 'organic', 19),
 ('Julia Behrman', 'adwords', 19),
 ('Sibyl Lauria', 'twitter', 19),
 ('Tia Amato', 'twitter', 19),
 ('Charles Bidwell', 'adwords', 18),
 ('Elba Felder', 'facebook', 18),
 ('Eugena Esser', 'facebook', 18),
 ('Georgianna Chisholm', 'facebook', 18),
 ('Micha Woodford', 'twitter', 18),
 ('Moon Torian', 'banner', 18),
 ('Moon Torian', 'twitter', 18),
 ('Nelle Meaux', 'banner', 18),
 ('Saran Ram', 'banner', 18),
 ('Arica Stoltzfus', 'banner', 17),
 ('Charles Bidwell', 'organic', 17),
 ('Elba Felder', 'adwords', 17),
 ('Elwood Shutt', 'facebook', 17),
 ('Maren Musto', 'banner', 17),
 ('Necole Victory', 'facebook', 17),
 ('Saran Ram', 'twitter', 17),
 ('Tia Amato', 'banner', 17),
 ('Charles Bidwell', 'banner', 16),
 ('Dorotha Seawell', 'banner', 16),
 ('Maryanna Fiorentino', 'twitter', 16),
 ('Michel Averette', 'banner', 16),
 ('Vernita Plump', 'twitter', 16),
 ('Akilah Drinkard', 'organic', 15),
 ('Ayesha Monica', 'facebook', 15),
 ('Charles Bidwell', 'twitter', 15),
 ('Derrick Boggess', 'facebook', 15),
 ('Eugena Esser', 'adwords', 15),
 ('Marquetta Laycock', 'organic', 15),
 ('Maryanna Fiorentino', 'banner', 15),
 ('Vernita Plump', 'banner', 15),
 ('Brandie Riva', 'twitter', 14),
 ('Carletta Kosinski', 'organic', 14),
 ('Debroah Wardle', 'adwords', 14),
 ('Debroah Wardle', 'organic', 14),
 ('Dorotha Seawell', 'twitter', 14),
 ('Elna Condello', 'banner', 14),
 ('Ernestine Pickron', 'facebook', 14),
 ('Ernestine Pickron', 'organic', 14),
 ('Renetta Carew', 'facebook', 14),
 ('Carletta Kosinski', 'facebook', 13),
 ('Georgianna Chisholm', 'twitter', 13),
 ('Julia Behrman', 'twitter', 13),
 ('Lavera Oles', 'organic', 13),
 ('Marquetta Laycock', 'adwords', 13),
 ('Retha Sears', 'organic', 13),
 ('Cliff Meints', 'twitter', 12),
 ('Dawna Agnew', 'banner', 12),
 ('Earlie Schleusner', 'twitter', 12),
 ('Elba Felder', 'twitter', 12),
 ('Elwood Shutt', 'twitter', 12),
 ('Gianna Dossey', 'twitter', 12),
 ('Hilma Busick', 'banner', 12),
 ('Hilma Busick', 'twitter', 12),
 ('Lavera Oles', 'facebook', 12),
 ('Sherlene Wetherington', 'adwords', 12),
 ('Arica Stoltzfus', 'twitter', 11),
 ('Carletta Kosinski', 'adwords', 11),
 ('Debroah Wardle', 'twitter', 11),
 ('Elna Condello', 'twitter', 11),
 ('Georgianna Chisholm', 'banner', 11),
 ('Lavera Oles', 'adwords', 11),
 ('Marquetta Laycock', 'facebook', 11),
 ('Nelle Meaux', 'twitter', 11),
 ('Renetta Carew', 'organic', 11),
 ('Samuel Racine', 'adwords', 11),
 ('Samuel Racine', 'facebook', 11),
 ('Calvin Ollison', 'banner', 10),
 ('Cordell Rieder', 'organic', 10),
 ('Dawna Agnew', 'twitter', 10),
 ('Debroah Wardle', 'banner', 10),
 ('Delilah Krum', 'banner', 10),
 ('Derrick Boggess', 'organic', 10),
 ('Gianna Dossey', 'banner', 10),
 ('Michel Averette', 'twitter', 10),
 ('Nakesha Renn', 'direct', 10),
 ('Renetta Carew', 'adwords', 10),
 ('Samuel Racine', 'organic', 10),
 ('Sherlene Wetherington', 'twitter', 10),
 ('Soraya Fulton', 'facebook', 10),
 ('Soraya Fulton', 'organic', 10),
 ('Akilah Drinkard', 'banner', 9),
 ('Akilah Drinkard', 'facebook', 9),
 ('Ayesha Monica', 'adwords', 9),
 ('Ayesha Monica', 'twitter', 9),
 ('Cara Clarke', 'adwords', 9),
 ('Chau Rowles', 'facebook', 9),
 ('Elwood Shutt', 'banner', 9),
 ('Julia Behrman', 'banner', 9),
 ('Julia Behrman', 'facebook', 9),
 ('Kathleen Lalonde', 'facebook', 9),
 ('Kathleen Lalonde', 'organic', 9),
 ('Sherlene Wetherington', 'organic', 9),
 ('Soraya Fulton', 'twitter', 9),
 ('Babette Soukup', 'banner', 8),
 ('Babette Soukup', 'facebook', 8),
 ('Brandie Riva', 'banner', 8),
 ('Calvin Ollison', 'twitter', 8),
 ('Cara Clarke', 'organic', 8),
 ('Eugena Esser', 'twitter', 8),
 ('Necole Victory', 'banner', 8),
 ('Retha Sears', 'adwords', 8),
 ('Sherlene Wetherington', 'banner', 8),
 ('Soraya Fulton', 'adwords', 8),
 ('Ayesha Monica', 'banner', 7),
 ('Babette Soukup', 'adwords', 7),
 ('Cordell Rieder', 'adwords', 7),
 ('Derrick Boggess', 'twitter', 7),
 ('Ernestine Pickron', 'banner', 7),
 ('Eugena Esser', 'banner', 7),
 ('Marquetta Laycock', 'twitter', 7),
 ('Renetta Carew', 'twitter', 7),
 ('Samuel Racine', 'banner', 7),
 ('Sibyl Lauria', 'banner', 7),
 ('Carletta Kosinski', 'banner', 6),
 ('Cliff Meints', 'banner', 6),
 ('Cordell Rieder', 'facebook', 6),
 ('Lavera Oles', 'banner', 6),
 ('Necole Victory', 'organic', 6),
 ('Renetta Carew', 'banner', 6),
 ('Sherlene Wetherington', 'facebook', 6),
 ('Akilah Drinkard', 'adwords', 5),
 ('Cara Clarke', 'banner', 5),
 ('Chau Rowles', 'twitter', 5),
 ('Julie Starr', 'banner', 5),
 ('Necole Victory', 'twitter', 5),
 ('Soraya Fulton', 'banner', 5),
 ('Carletta Kosinski', 'twitter', 4),
 ('Chau Rowles', 'banner', 4),
 ('Lavera Oles', 'twitter', 4),
 ('Marquetta Laycock', 'banner', 4),
 ('Retha Sears', 'facebook', 4),
 ('Babette Soukup', 'twitter', 3),
 ('Cara Clarke', 'facebook', 3),
 ('Chau Rowles', 'adwords', 3),
 ('Chau Rowles', 'organic', 3),
 ('Cordell Rieder', 'banner', 3),
 ('Derrick Boggess', 'banner', 3),
 ('Elba Felder', 'banner', 3),
 ('Ernestine Pickron', 'twitter', 3),
 ('Julie Starr', 'adwords', 3),
 ('Julie Starr', 'facebook', 3),
 ('Retha Sears', 'twitter', 3),
 ('Akilah Drinkard', 'twitter', 2),
 ('Babette Soukup', 'organic', 2),
 ('Cordell Rieder', 'twitter', 2),
 ('Julie Starr', 'organic', 2),
 ('Kathleen Lalonde', 'adwords', 2),
 ('Kathleen Lalonde', 'twitter', 2),
 ('Nakesha Renn', 'banner', 2),
 ('Retha Sears', 'banner', 2),
 ('Samuel Racine', 'twitter', 2),
 ('Shawanda Selke', 'adwords', 2),
 ('Silvana Virden', 'adwords', 2),
 ('Silvana Virden', 'banner', 2),
 ('Silvana Virden', 'twitter', 2),
 ('Cara Clarke', 'twitter', 1),
 ('Kathleen Lalonde', 'banner', 1),
 ('Nakesha Renn', 'facebook', 1),
 ('Nakesha Renn', 'organic', 1),
 ('Nakesha Renn', 'twitter', 1),
 ('Shawanda Selke', 'banner', 1),
 ('Shawanda Selke', 'facebook', 1),
 ('Shawanda Selke', 'organic', 1)]

In [87]:
%%sql
SELECT r.name, w.channel, COUNT(*) num_events
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
JOIN sales_reps s
ON s.id = a.sales_rep_id
JOIN region r
ON r.id = s.region_id
GROUP BY r.name, w.channel
ORDER BY num_events DESC;

 * sqlite:///pandp.db
Done.

[('Northeast', 'direct', 1800),
 ('Southeast', 'direct', 1548),
 ('West', 'direct', 1254),
 ('Midwest', 'direct', 696),
 ('Northeast', 'facebook', 335),
 ('Northeast', 'organic', 317),
 ('Northeast', 'adwords', 300),
 ('Southeast', 'facebook', 278),
 ('Southeast', 'organic', 275),
 ('Southeast', 'adwords', 264),
 ('West', 'organic', 243),
 ('West', 'adwords', 241),
 ('West', 'facebook', 229),
 ('Northeast', 'banner', 155),
 ('Northeast', 'twitter', 154),
 ('Southeast', 'banner', 146),
 ('Southeast', 'twitter', 127),
 ('Midwest', 'facebook', 125),
 ('West', 'twitter', 122),
 ('Midwest', 'organic', 117),
 ('West', 'banner', 116),
 ('Midwest', 'adwords', 101),
 ('Midwest', 'twitter', 71),
 ('Midwest', 'banner', 59)]

## Distinct

In [88]:
%%sql
SELECT DISTINCT column1, column2, column3
FROM table1;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such table: table1
[SQL: SELECT DISTINCT column1, column2, column3
FROM table1;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [89]:
%%sql
SELECT DISTINCT column1, DISTINCT column2, DISTINCT column3
FROM table1;

 * sqlite:///pandp.db
(sqlite3.OperationalError) near "DISTINCT": syntax error
[SQL: SELECT DISTINCT column1, DISTINCT column2, DISTINCT column3
FROM table1;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [90]:
%%sql
SELECT account_id,
       channel,
       COUNT(id) as events
FROM web_events
GROUP BY account_id, channel
ORDER BY account_id, channel DESC
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'twitter', 1),
 (1001, 'organic', 6),
 (1001, 'facebook', 2),
 (1001, 'direct', 22),
 (1001, 'banner', 3)]

In [91]:
%%sql
SELECT account_id,
       channel
FROM web_events
GROUP BY account_id, channel
ORDER BY account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'adwords'),
 (1001, 'banner'),
 (1001, 'direct'),
 (1001, 'facebook'),
 (1001, 'organic')]

In [92]:
%%sql
SELECT DISTINCT account_id,
       channel
FROM web_events
ORDER BY account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'direct'),
 (1001, 'facebook'),
 (1001, 'organic'),
 (1001, 'adwords'),
 (1001, 'twitter')]

In [93]:
%%sql
SELECT a.id as "account id", r.id as "region id", 
a.name as "account name", r.name as "region name"
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
JOIN region r
ON r.id = s.region_id;

 * sqlite:///pandp.db
Done.

[(1001, 1, 'Walmart', 'Northeast'),
 (1011, 1, 'Exxon Mobil', 'Northeast'),
 (1021, 1, 'Apple', 'Northeast'),
 (1031, 1, 'Berkshire Hathaway', 'Northeast'),
 (1041, 1, 'McKesson', 'Northeast'),
 (1051, 1, 'UnitedHealth Group', 'Northeast'),
 (1061, 1, 'CVS Health', 'Northeast'),
 (1071, 1, 'General Motors', 'Northeast'),
 (1081, 1, 'Ford Motor', 'Northeast'),
 (1091, 1, 'AT&T', 'Northeast'),
 (1101, 1, 'General Electric', 'Northeast'),
 (1111, 1, 'AmerisourceBergen', 'Northeast'),
 (1121, 1, 'Verizon', 'Northeast'),
 (1131, 1, 'Chevron', 'Northeast'),
 (1141, 1, 'Costco', 'Northeast'),
 (1151, 1, 'Fannie Mae', 'Northeast'),
 (1161, 1, 'Kroger', 'Northeast'),
 (1171, 1, 'Amazon.com', 'Northeast'),
 (1181, 1, 'Walgreens Boots Alliance', 'Northeast'),
 (1191, 1, 'HP', 'Northeast'),
 (1201, 1, 'Cardinal Health', 'Northeast'),
 (1211, 1, 'Express Scripts Holding', 'Northeast'),
 (1221, 1, 'J.P. Morgan Chase', 'Northeast'),
 (1231, 1, 'Boeing', 'Northeast'),
 (1241, 1, 'Microsoft', 'Northeast'),
 (1251, 1, 'Bank of America Corp.', 'Northeast'),
 (1261, 1, 'Wells Fargo', 'Northeast'),
 (1271, 1, 'Home Depot', 'Northeast'),
 (1281, 1, 'Citigroup', 'Northeast'),
 (1291, 1, 'Phillips 66', 'Northeast'),
 (1301, 1, 'IBM', 'Northeast'),
 (1311, 1, 'Valero Energy', 'Northeast'),
 (1321, 1, 'Anthem', 'Northeast'),
 (1331, 1, 'Procter & Gamble', 'Northeast'),
 (1341, 1, 'State Farm Insurance Cos.', 'Northeast'),
 (1351, 1, 'Alphabet', 'Northeast'),
 (1361, 1, 'Comcast', 'Northeast'),
 (1371, 1, 'Target', 'Northeast'),
 (1381, 1, 'Johnson & Johnson', 'Northeast'),
 (1391, 1, 'MetLife', 'Northeast'),
 (1401, 1, 'Archer Daniels Midland', 'Northeast'),
 (1411, 1, 'Marathon Petroleum', 'Northeast'),
 (1421, 1, 'Freddie Mac', 'Northeast'),
 (1431, 1, 'PepsiCo', 'Northeast'),
 (1441, 1, 'United Technologies', 'Northeast'),
 (1451, 1, 'Aetna', 'Northeast'),
 (1461, 1, "Lowe's", 'Northeast'),
 (1471, 1, 'UPS', 'Northeast'),
 (1481, 1, 'AIG', 'Northeast'),
 (1491, 1, 'Prudential Financial', 'Northeast'),
 (1501, 1, 'Intel', 'Northeast'),
 (1511, 1, 'Humana', 'Northeast'),
 (1521, 1, 'Disney', 'Northeast'),
 (1531, 1, 'Cisco Systems', 'Northeast'),
 (1541, 1, 'Pfizer', 'Northeast'),
 (1551, 1, 'Dow Chemical', 'Northeast'),
 (1561, 1, 'Sysco', 'Northeast'),
 (1571, 1, 'FedEx', 'Northeast'),
 (1581, 1, 'Caterpillar', 'Northeast'),
 (1591, 1, 'Lockheed Martin', 'Northeast'),
 (1601, 1, 'New York Life Insurance', 'Northeast'),
 (1611, 1, 'Coca-Cola', 'Northeast'),
 (1621, 1, 'HCA Holdings', 'Northeast'),
 (1631, 1, 'Ingram Micro', 'Northeast'),
 (1641, 1, 'Energy Transfer Equity', 'Northeast'),
 (1651, 1, 'Tyson Foods', 'Northeast'),
 (1661, 1, 'American Airlines Group', 'Northeast'),
 (1671, 1, 'Delta Air Lines', 'Northeast'),
 (1681, 1, 'Nationwide', 'Northeast'),
 (1691, 1, 'Johnson Controls', 'Northeast'),
 (1701, 1, 'Best Buy', 'Northeast'),
 (1711, 1, 'Merck', 'Northeast'),
 (1721, 1, 'Liberty Mutual Insurance Group', 'Northeast'),
 (1731, 1, 'Goldman Sachs Group', 'Northeast'),
 (1741, 1, 'Honeywell International', 'Northeast'),
 (1751, 1, 'Massachusetts Mutual Life Insurance', 'Northeast'),
 (1761, 1, 'Oracle', 'Northeast'),
 (1771, 1, 'Morgan Stanley', 'Northeast'),
 (1781, 1, 'Cigna', 'Northeast'),
 (1791, 1, 'United Continental Holdings', 'Northeast'),
 (1801, 1, 'Allstate', 'Northeast'),
 (1811, 1, 'TIAA', 'Northeast'),
 (1821, 1, 'INTL FCStone', 'Northeast'),
 (1831, 1, 'CHS', 'Northeast'),
 (1841, 1, 'American Express', 'Northeast'),
 (1851, 1, 'Gilead Sciences', 'Northeast'),
 (1861, 1, 'Publix Super Markets', 'Northeast'),
 (1871, 1, 'General Dynamics', 'Northeast'),
 (1881, 1, 'TJX', 'Northeast'),
 (1891, 1, 'ConocoPhillips', 'Northeast'),
 (1901, 1, 'Nike', 'Northeast'),
 (1911, 1, 'World Fuel Services', 'Northeast'),
 (1921, 1, '3M', 'Northeast'),
 (1931, 1, 'Mondelez International', 'Northeast'),
 (1941, 1, 'Exelon', 'Northeast'),
 (1951, 1, 'Twenty-First Century Fox', 'Northeast'),
 (1961, 1, 'Deere', 'Northeast'),
 (1971, 1, 'Tesoro', 'Northeast'),
 (1981, 1, 'Time Warner', 'Northeast'),
 (1991, 1, 'Northwestern Mutual', 'Northeast'),
 (2001, 1, 'DuPont', 'Northeast'),
 (2011, 1, 'Avnet', 'Northeast'),
 (2021, 1, "Macy's", 'Northeast'),
 (2031, 1, 'Enterprise Products Partners', 'Northeast'),
 (2041, 1, 'Travelers Cos.', 'Northeast'),
 (2051, 1, 'Philip Morris International', 'Northeast'),
 (2061, 2, 'Rite Aid', 'Midwest'),
 (2071, 2, 'Tech Data', 'Midwest'),
 (2081, 2, "McDonald's", 'Midwest'),
 (2091, 2, 'Qualcomm', 'Midwest'),
 (2101, 2, 'Sears Holdings', 'Midwest'),
 (2111, 2, 'Capital One Financial', 'Midwest'),
 (2121, 2, 'EMC', 'Midwest'),
 (2131, 2, 'USAA', 'Midwest'),
 (2141, 2, 'Duke Energy', 'Midwest'),
 (2151, 2, 'Time Warner Cable', 'Midwest'),
 (2161, 2, 'Halliburton', 'Midwest'),
 (2171, 2, 'Northrop Grumman', 'Midwest'),
 (2181, 2, 'Arrow Electronics', 'Midwest'),
 (2191, 2, 'Raytheon', 'Midwest'),
 (2201, 2, 'Plains GP Holdings', 'Midwest'),
 (2211, 2, 'US Foods Holding', 'Midwest'),
 (2221, 2, 'AbbVie', 'Midwest'),
 (2231, 2, 'Centene', 'Midwest'),
 (2241, 2, 'Community Health Systems', 'Midwest'),
 (2251, 2, 'Alcoa', 'Midwest'),
 (2261, 2, 'International Paper', 'Midwest'),
 (2271, 2, 'Emerson Electric', 'Midwest'),
 (2281, 2, 'Union Pacific', 'Midwest'),
 (2291, 2, 'Amgen', 'Midwest'),
 (2301, 2, 'U.S. Bancorp', 'Midwest'),
 (2311, 2, 'Staples', 'Midwest'),
 (2321, 2, 'Danaher', 'Midwest'),
 (2331, 2, 'Whirlpool', 'Midwest'),
 (2341, 2, 'Aflac', 'Midwest'),
 (2351, 2, 'AutoNation', 'Midwest'),
 (2361, 2, 'Progressive', 'Midwest'),
 (2371, 2, 'Abbott Laboratories', 'Midwest'),
 (2381, 2, 'Dollar General', 'Midwest'),
 (2391, 2, 'Tenet Healthcare', 'Midwest'),
 (2401, 2, 'Eli Lilly', 'Midwest'),
 (2411, 2, 'Southwest Airlines', 'Midwest'),
 (2421, 2, 'Penske Automotive Group', 'Midwest'),
 (2431, 2, 'ManpowerGroup', 'Midwest'),
 (2441, 2, "Kohl's", 'Midwest'),
 (2451, 2, 'Starbucks', 'Midwest'),
 (2461, 2, 'Paccar', 'Midwest'),
 (2471, 2, 'Cummins', 'Midwest'),
 (2481, 2, 'Altria Group', 'Midwest'),
 (2491, 2, 'Xerox', 'Midwest'),
 (2501, 2, 'Kimberly-Clark', 'Midwest'),
 (2511, 2, 'Hartford Financial Services Group', 'Midwest'),
 (2521, 2, 'Kraft Heinz', 'Midwest'),
 (2531, 2, 'Lear', 'Midwest'),
 (2541, 3, 'Fluor', 'Southeast'),
 (2551, 3, 'AECOM', 'Southeast'),
 (2561, 3, 'Facebook', 'Southeast'),
 (2571, 3, 'Jabil Circuit', 'Southeast'),
 (2581, 3, 'CenturyLink', 'Southeast'),
 (2591, 3, 'Supervalu', 'Southeast'),
 (2601, 3, 'General Mills', 'Southeast'),
 (2611, 3, 'Southern', 'Southeast'),
 (2621, 3, 'NextEra Energy', 'Southeast'),
 (2631, 3, 'Thermo Fisher Scientific', 'Southeast'),
 (2641, 3, 'American Electric Power', 'Southeast'),
 (2651, 3, 'PG&E Corp.', 'Southeast'),
 (2661, 3, 'NGL Energy Partners', 'Southeast'),
 (2671, 3, 'Bristol-Myers Squibb', 'Southeast'),
 (2681, 3, 'Goodyear Tire & Rubber', 'Southeast'),
 (2691, 3, 'Nucor', 'Southeast'),
 (2701, 3, 'PNC Financial Services Group', 'Southeast'),
 (2711, 3, 'Health Net', 'Southeast'),
 (2721, 3, 'Micron Technology', 'Southeast'),
 (2731, 3, 'Colgate-Palmolive', 'Southeast'),
 (2741, 3, 'Freeport-McMoRan', 'Southeast'),
 (2751, 3, 'ConAgra Foods', 'Southeast'),
 (2761, 3, 'Gap', 'Southeast'),
 (2771, 3, 'Baker Hughes', 'Southeast'),
 (2781, 3, 'Bank of New York Mellon Corp.', 'Southeast'),
 (2791, 3, 'Dollar Tree', 'Southeast'),
 (2801, 3, 'Whole Foods Market', 'Southeast'),
 (2811, 3, 'PPG Industries', 'Southeast'),
 (2821, 3, 'Genuine Parts', 'Southeast'),
 (2831, 3, 'Icahn Enterprises', 'Southeast'),
 (2841, 3, 'Performance Food Group', 'Southeast'),
 (2851, 3, 'Omnicom Group', 'Southeast'),
 (2861, 3, 'DISH Network', 'Southeast'),
 (2871, 3, 'FirstEnergy', 'Southeast'),
 (2881, 3, 'Monsanto', 'Southeast'),
 (2891, 3, 'AES', 'Southeast'),
 (2901, 3, 'CarMax', 'Southeast'),
 (2911, 3, 'National Oilwell Varco', 'Southeast'),
 (2921, 3, 'NRG Energy', 'Southeast'),
 (2931, 3, 'Western Digital', 'Southeast'),
 (2941, 3, 'Marriott International', 'Southeast'),
 (2951, 3, 'Office Depot', 'Southeast'),
 (2961, 3, 'Nordstrom', 'Southeast'),
 (2971, 3, 'Kinder Morgan', 'Southeast'),
 (2981, 3, 'Aramark', 'Southeast'),
 (2991, 3, 'DaVita HealthCare Partners', 'Southeast'),
 (3001, 3, 'Molina Healthcare', 'Southeast'),
 (3011, 3, 'WellCare Health Plans', 'Southeast'),
 (3021, 3, 'CBS', 'Southeast'),
 (3031, 3, 'Visa', 'Southeast'),
 (3041, 3, 'Lincoln National', 'Southeast'),
 (3051, 3, 'Ecolab', 'Southeast'),
 (3061, 3, 'Kellogg', 'Southeast'),
 (3071, 3, 'C.H. Robinson Worldwide', 'Southeast'),
 (3081, 3, 'Textron', 'Southeast'),
 (3091, 3, 'Loews', 'Southeast'),
 (3101, 3, 'Illinois Tool Works', 'Southeast'),
 (3111, 3, 'Synnex', 'Southeast'),
 (3121, 3, 'Viacom', 'Southeast'),
 (3131, 3, 'HollyFrontier', 'Southeast'),
 (3141, 3, "Land O'Lakes", 'Southeast'),
 (3151, 3, 'Devon Energy', 'Southeast'),
 (3161, 3, 'PBF Energy', 'Southeast'),
 (3171, 3, 'Yum Brands', 'Southeast'),
 (3181, 3, 'Texas Instruments', 'Southeast'),
 (3191, 3, 'CDW', 'Southeast'),
 (3201, 3, 'Waste Management', 'Southeast'),
 (3211, 3, 'Marsh & McLennan', 'Southeast'),
 (3221, 3, 'Chesapeake Energy', 'Southeast'),
 (3231, 3, 'Parker-Hannifin', 'Southeast'),
 (3241, 3, 'Occidental Petroleum', 'Southeast'),
 (3251, 3, 'Guardian Life Ins. Co. of America', 'Southeast'),
 (3261, 3, 'Farmers Insurance Exchange', 'Southeast'),
 (3271, 3, 'J.C. Penney', 'Southeast'),
 (3281, 3, 'Consolidated Edison', 'Southeast'),
 (3291, 3, 'Cognizant Technology Solutions', 'Southeast'),
 (3301, 3, 'VF', 'Southeast'),
 (3311, 3, 'Ameriprise Financial', 'Southeast'),
 (3321, 3, 'Computer Sciences', 'Southeast'),
 (3331, 3, 'L Brands', 'Southeast'),
 (3341, 3, 'Jacobs Engineering Group', 'Southeast'),
 (3351, 3, 'Principal Financial', 'Southeast'),
 (3361, 3, 'Ross Stores', 'Southeast'),
 (3371, 3, 'Bed Bath & Beyond', 'Southeast'),
 (3381, 3, 'CSX', 'Southeast'),
 (3391, 3, "Toys 'R' Us", 'Southeast'),
 (3401, 3, 'Las Vegas Sands', 'Southeast'),
 (3411, 3, 'Leucadia National', 'Southeast'),
 (3421, 3, 'Dominion Resources', 'Southeast'),
 (3431, 3, 'United States Steel', 'Southeast'),
 (3441, 3, 'L-3 Communications', 'Southeast'),
 (3451, 3, 'Edison International', 'Southeast'),
 (3461, 3, 'Entergy', 'Southeast'),
 (3471, 3, 'ADP', 'Southeast'),
 (3481, 3, 'First Data', 'Southeast'),
 (3491, 3, 'BlackRock', 'Southeast'),
 (3501, 4, 'WestRock', 'West'),
 (3511, 4, 'Voya Financial', 'West'),
 (3521, 4, 'Sherwin-Williams', 'West'),
 (3531, 4, 'Hilton Worldwide Holdings', 'West'),
 (3541, 4, 'R.R. Donnelley & Sons', 'West'),
 (3551, 4, 'Stanley Black & Decker', 'West'),
 (3561, 4, 'Xcel Energy', 'West'),
 (3571, 4, 'Murphy USA', 'West'),
 (3581, 4, 'CBRE Group', 'West'),
 (3591, 4, 'D.R. Horton', 'West'),
 (3601, 4, 'Estee Lauder', 'West'),
 (3611, 4, 'Praxair', 'West'),
 (3621, 4, 'Biogen', 'West'),
 (3631, 4, 'State Street Corp.', 'West'),
 (3641, 4, 'Unum Group', 'West'),
 (3651, 4, 'Reynolds American', 'West'),
 (3661, 4, 'Group 1 Automotive', 'West'),
 (3671, 4, 'Henry Schein', 'West'),
 (3681, 4, 'Hertz Global Holdings', 'West'),
 (3691, 4, 'Norfolk Southern', 'West'),
 (3701, 4, 'Reinsurance Group of America', 'West'),
 (3711, 4, 'Public Service Enterprise Group', 'West'),
 (3721, 4, 'BB&T Corp.', 'West'),
 (3731, 4, 'DTE Energy', 'West'),
 (3741, 4, 'Assurant', 'West'),
 (3751, 4, 'Global Partners', 'West'),
 (3761, 4, 'Huntsman', 'West'),
 (3771, 4, 'Becton Dickinson', 'West'),
 (3781, 4, 'Sempra Energy', 'West'),
 (3791, 4, 'AutoZone', 'West'),
 (3801, 4, 'Navistar International', 'West'),
 (3811, 4, 'Precision Castparts', 'West'),
 (3821, 4, 'Discover Financial Services', 'West'),
 (3831, 4, 'Liberty Interactive', 'West'),
 (3841, 4, 'W.W. Grainger', 'West'),
 (3851, 4, 'Baxter International', 'West'),
 (3861, 4, 'Stryker', 'West'),
 (3871, 4, 'Air Products & Chemicals', 'West'),
 (3881, 4, 'Western Refining', 'West'),
 (3891, 4, 'Universal Health Services', 'West'),
 (3901, 4, 'Owens & Minor', 'West'),
 (3911, 4, 'Charter Communications', 'West'),
 (3921, 4, 'Advance Auto Parts', 'West'),
 (3931, 4, 'MasterCard', 'West'),
 (3941, 4, 'Applied Materials', 'West'),
 (3951, 4, 'Eastman Chemical', 'West'),
 (3961, 4, 'Sonic Automotive', 'West'),
 (3971, 4, 'Ally Financial', 'West'),
 (3981, 4, 'CST Brands', 'West'),
 (3991, 4, 'eBay', 'West'),
 (4001, 4, 'Lennar', 'West'),
 (4011, 4, 'GameStop', 'West'),
 (4021, 4, 'Reliance Steel & Aluminum', 'West'),
 (4031, 4, 'Hormel Foods', 'West'),
 (4041, 4, 'Celgene', 'West'),
 (4051, 4, 'Genworth Financial', 'West'),
 (4061, 4, 'PayPal Holdings', 'West'),
 (4071, 4, 'Priceline Group', 'West'),
 (4081, 4, 'MGM Resorts International', 'West'),
 (4091, 4, 'Autoliv', 'West'),
 (4101, 4, 'Fidelity National Financial', 'West'),
 (4111, 4, 'Republic Services', 'West'),
 (4121, 4, 'Corning', 'West'),
 (4131, 4, "Peter Kiewit Sons'", 'West'),
 (4141, 4, 'Univar', 'West'),
 (4151, 4, 'Mosaic', 'West'),
 (4161, 4, 'Core-Mark Holding', 'West'),
 (4171, 4, 'Thrivent Financial for Lutherans', 'West'),
 (4181, 4, 'Cameron International', 'West'),
 (4191, 4, 'HD Supply Holdings', 'West'),
 (4201, 4, 'Crown Holdings', 'West'),
 (4211, 4, 'EOG Resources', 'West'),
 (4221, 4, 'Veritiv', 'West'),
 (4231, 4, 'Anadarko Petroleum', 'West'),
 (4241, 4, 'Laboratory Corp. of America', 'West'),
 (4251, 4, 'Pacific Life', 'West'),
 (4261, 4, 'News Corp.', 'West'),
 (4271, 4, 'Jarden', 'West'),
 (4281, 4, 'SunTrust Banks', 'West'),
 (4291, 4, 'Avis Budget Group', 'West'),
 (4301, 4, 'Broadcom', 'West'),
 (4311, 4, 'American Family Insurance Group', 'West'),
 (4321, 4, 'Level 3 Communications', 'West'),
 (4331, 4, 'Tenneco', 'West'),
 (4341, 4, 'United Natural Foods', 'West'),
 (4351, 4, 'Dean Foods', 'West'),
 (4361, 4, 'Campbell Soup', 'West'),
 (4371, 4, 'Mohawk Industries', 'West'),
 (4381, 4, 'BorgWarner', 'West'),
 (4391, 4, 'PVH', 'West'),
 (4401, 4, 'Ball', 'West'),
 (4411, 4, "O'Reilly Automotive", 'West'),
 (4421, 4, 'Eversource Energy', 'West'),
 (4431, 4, 'Franklin Resources', 'West'),
 (4441, 4, 'Masco', 'West'),
 (4451, 4, 'Lithia Motors', 'West'),
 (4461, 4, 'KKR', 'West'),
 (4471, 4, 'Oneok', 'West'),
 (4481, 4, 'Newmont Mining', 'West'),
 (4491, 4, 'PPL', 'West'),
 (4501, 4, 'SpartanNash', 'West')]

In [94]:
%%sql
SELECT DISTINCT (id), name
FROM accounts
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart'),
 (1011, 'Exxon Mobil'),
 (1021, 'Apple'),
 (1031, 'Berkshire Hathaway'),
 (1041, 'McKesson')]

In [95]:
%%sql
SELECT s.id, s.name, COUNT(*) num_accounts
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.id, s.name
ORDER BY num_accounts;

 * sqlite:///pandp.db
Done.

[(321570, 'Shawanda Selke', 3),
 (321600, 'Ernestine Pickron', 3),
 (321610, 'Ayesha Monica', 3),
 (321620, 'Retha Sears', 3),
 (321650, 'Akilah Drinkard', 3),
 (321660, 'Silvana Virden', 3),
 (321670, 'Nakesha Renn', 3),
 (321790, 'Cordell Rieder', 3),
 (321530, 'Renetta Carew', 4),
 (321540, 'Cara Clarke', 4),
 (321550, 'Lavera Oles', 4),
 (321770, 'Kathleen Lalonde', 4),
 (321780, 'Julie Starr', 4),
 (321710, 'Sherlene Wetherington', 5),
 (321720, 'Chau Rowles', 5),
 (321730, 'Carletta Kosinski', 5),
 (321500, 'Samuel Racine', 6),
 (321510, 'Eugena Esser', 6),
 (321560, 'Elba Felder', 6),
 (321580, 'Sibyl Lauria', 6),
 (321590, 'Necole Victory', 6),
 (321700, 'Debroah Wardle', 6),
 (321520, 'Michel Averette', 7),
 (321680, 'Elna Condello', 7),
 (321690, 'Gianna Dossey', 7),
 (321740, 'Charles Bidwell', 7),
 (321750, 'Cliff Meints', 7),
 (321870, 'Derrick Boggess', 7),
 (321880, 'Babette Soukup', 7),
 (321890, 'Nelle Meaux', 7),
 (321900, 'Soraya Fulton', 7),
 (321630, 'Julia Behrman', 8),
 (321640, 'Tia Amato', 8),
 (321760, 'Delilah Krum', 8),
 (321920, 'Marquetta Laycock', 9),
 (321950, 'Elwood Shutt', 9),
 (321990, 'Dawna Agnew', 9),
 (321810, 'Moon Torian', 10),
 (321860, 'Saran Ram', 10),
 (321910, 'Brandie Riva', 10),
 (321930, 'Hilma Busick', 10),
 (321940, 'Arica Stoltzfus', 10),
 (321800, 'Earlie Schleusner', 11),
 (321820, 'Dorotha Seawell', 11),
 (321830, 'Maren Musto', 11),
 (321840, 'Vernita Plump', 11),
 (321850, 'Calvin Ollison', 11),
 (321960, 'Maryanna Fiorentino', 11),
 (321980, 'Micha Woodford', 11),
 (321970, 'Georgianna Chisholm', 15)]

In [96]:
%%sql
SELECT account_id,
       SUM(total_amt_usd) AS sum_total_amt_usd
FROM orders
GROUP BY 1
ORDER BY 2 DESC

 * sqlite:///pandp.db
Done.

[(4211, 382873.3),
 (4151, 345618.5900000001),
 (1301, 326819.48000000004),
 (1871, 300694.7899999999),
 (4111, 293861.14000000013),
 (3411, 291047.25000000006),
 (2181, 281018.36),
 (1561, 278575.63999999996),
 (2591, 275288.30000000005),
 (1401, 272672.83999999997),
 (2931, 269155.33999999997),
 (4251, 255319.18000000002),
 (2861, 253635.7500000001),
 (2541, 251299.77),
 (3431, 244695.99),
 (4291, 241711.24999999997),
 (2231, 238962.47000000003),
 (1451, 237781.3),
 (1441, 235051.07),
 (1421, 234225.65),
 (4161, 231856.97999999992),
 (4461, 217473.85000000003),
 (1521, 205886.96999999994),
 (1261, 200174.66),
 (2671, 188457.45999999996),
 (2681, 185463.76000000004),
 (4271, 179761.43000000002),
 (1501, 167717.4),
 (1831, 167271.8),
 (1701, 163887.39000000004),
 (3471, 163579.18),
 (2461, 161294.61999999997),
 (1281, 160051.04000000007),
 (1491, 157782.52),
 (3251, 157523.23999999996),
 (2041, 156582.24),
 (1081, 154811.42999999996),
 (2631, 153705.1),
 (4311, 153015.86999999997),
 (3491, 147599.56),
 (1541, 144865.83000000002),
 (2271, 143471.26),
 (1881, 140046.68000000002),
 (2101, 139015.09000000003),
 (3141, 138323.58999999997),
 (2051, 137600.66999999998),
 (1411, 137227.88),
 (3911, 135924.15),
 (2351, 135822.85000000003),
 (4431, 135730.44000000003),
 (3051, 135517.95),
 (3111, 134039.25),
 (2871, 132868.82),
 (2911, 131318.63999999998),
 (1291, 131173.40999999997),
 (2881, 130964.10999999999),
 (1531, 130917.00000000001),
 (2731, 130893.51000000001),
 (1181, 130153.59000000001),
 (1921, 127945.1),
 (1781, 127671.94000000002),
 (1601, 126898.91000000002),
 (2411, 125968.03999999996),
 (1001, 124014.87000000001),
 (3721, 123847.32),
 (3461, 123503.17999999995),
 (3981, 122957.11000000004),
 (1371, 120523.91000000003),
 (1571, 119965.08000000002),
 (3631, 119173.59),
 (1791, 118879.76000000001),
 (2141, 118867.17000000001),
 (2341, 117862.77),
 (2481, 116165.15),
 (1121, 115376.17000000001),
 (4491, 112176.02999999998),
 (1341, 111810.54999999999),
 (4101, 110027.29000000001),
 (3881, 108579.84),
 (4451, 107142.63000000003),
 (3241, 105115.44),
 (3191, 101553.15000000001),
 (4281, 99125.76000000001),
 (3591, 98474.43999999999),
 (2371, 96819.92000000001),
 (1801, 96779.18000000001),
 (4041, 96593.53),
 (3261, 96376.93999999999),
 (2191, 94725.92000000001),
 (1221, 94684.25),
 (3991, 94244.44000000003),
 (1251, 93217.79999999999),
 (2441, 90105.16),
 (4031, 88946.13999999998),
 (1741, 86362.69999999998),
 (4061, 84768.93999999997),
 (3061, 83419.37999999996),
 (2291, 82013.04999999999),
 (1581, 81700.32999999999),
 (2651, 81697.27),
 (4231, 80328.56),
 (3131, 79488.37000000001),
 (2571, 79246.93),
 (3041, 77628.11),
 (1681, 76630.92000000001),
 (3341, 75600.49),
 (4301, 75130.49999999999),
 (4201, 75110.81),
 (3711, 73833.01),
 (2361, 72875.83999999998),
 (3551, 72788.52),
 (2111, 72595.01000000001),
 (1981, 69479.05999999998),
 (3751, 67909.95999999999),
 (4181, 67459.64999999998),
 (3101, 67439.95000000001),
 (2011, 66812.23999999999),
 (3001, 66381.57),
 (3791, 65958.07),
 (1231, 65091.39),
 (3421, 64604.0),
 (1711, 64536.16999999999),
 (2901, 64251.560000000005),
 (3811, 63743.89),
 (3291, 62504.05),
 (1851, 62148.869999999995),
 (2821, 61561.44),
 (3031, 61255.49999999999),
 (2691, 60936.18000000001),
 (1161, 59946.4),
 (2921, 59727.21),
 (2261, 59086.759999999995),
 (2151, 57130.53),
 (4421, 57059.76),
 (3821, 57035.05),
 (2241, 56644.600000000006),
 (3391, 56179.21000000001),
 (1191, 56162.34),
 (3311, 55883.55000000001),
 (2971, 54891.56),
 (3181, 54792.72),
 (4341, 54443.06),
 (2091, 54114.020000000004),
 (1311, 52020.600000000006),
 (1091, 51647.76000000002),
 (2951, 51477.19),
 (4191, 50888.03),
 (2381, 49975.93),
 (3651, 49930.289999999986),
 (2741, 49162.7),
 (2171, 48578.159999999996),
 (2841, 47645.86),
 (1321, 47487.78),
 (1651, 47417.76),
 (2081, 47258.13),
 (2131, 46822.63),
 (1131, 46725.41),
 (2701, 46208.37000000001),
 (3481, 45967.25),
 (1461, 45873.469999999994),
 (1841, 45557.50999999999),
 (2581, 44535.04),
 (3221, 44534.950000000004),
 (1351, 44407.22),
 (1611, 43692.28999999999),
 (2611, 42881.21),
 (1951, 42065.82000000001),
 (4381, 41242.060000000005),
 (2851, 41161.06000000001),
 (2661, 40607.06999999999),
 (2831, 38851.149999999994),
 (1111, 38741.81),
 (3531, 38648.009999999995),
 (3781, 38569.85),
 (4011, 38469.65),
 (4171, 38204.46000000001),
 (3601, 38198.82000000001),
 (1691, 37796.280000000006),
 (3971, 37653.96),
 (1931, 37465.37),
 (3451, 37010.95),
 (2121, 36982.12),
 (3571, 36294.27),
 (3541, 36218.43),
 (3771, 35961.76),
 (3381, 35759.700000000004),
 (3671, 35487.34),
 (2471, 34839.82),
 (4261, 34675.03),
 (2991, 33982.78),
 (3121, 33673.85999999999),
 (2391, 33028.08),
 (2331, 32965.13),
 (1511, 32937.92999999999),
 (2161, 32645.38),
 (2601, 32226.369999999995),
 (2641, 32044.55),
 (2031, 31971.72),
 (2961, 31273.019999999997),
 (1761, 31231.559999999998),
 (1141, 30741.01),
 (3661, 30708.920000000002),
 (1431, 30095.72),
 (1661, 30083.179999999993),
 (2501, 29151.210000000003),
 (1171, 28678.06),
 (3171, 28296.530000000002),
 (3321, 28012.069999999996),
 (2711, 27733.33),
 (1941, 27558.300000000007),
 (2211, 27074.63),
 (2301, 26641.71),
 (4351, 26514.93),
 (2421, 26485.87),
 (3081, 26339.699999999997),
 (4361, 25765.949999999997),
 (2521, 25765.170000000002),
 (2001, 25526.3),
 (4241, 25507.06),
 (1101, 25335.68),
 (1631, 25198.550000000003),
 (2281, 25107.81),
 (3361, 24961.87),
 (2531, 23718.31),
 (1061, 23667.51),
 (2561, 23522.79),
 (1331, 22961.03),
 (3641, 22734.13),
 (3851, 22681.17),
 (3801, 22484.81),
 (3441, 22266.77),
 (3691, 22100.01),
 (2811, 21960.88),
 (1051, 21937.08),
 (2981, 21692.010000000002),
 (1021, 20767.15),
 (1771, 20277.570000000003),
 (2511, 20257.430000000004),
 (2801, 20240.66),
 (4131, 20232.97),
 (3761, 20092.350000000002),
 (3561, 19975.91),
 (4441, 19963.61),
 (2251, 19882.160000000003),
 (1641, 19539.86),
 (2771, 19409.949999999997),
 (3621, 19386.53),
 (2071, 19218.88),
 (2751, 19142.48),
 (1211, 19090.449999999997),
 (3611, 19023.360000000004),
 (2551, 18491.510000000002),
 (3161, 18285.93),
 (3301, 18251.39),
 (1381, 18242.739999999998),
 (3331, 17439.25),
 (4081, 16976.760000000002),
 (1721, 16923.55),
 (2761, 16791.91),
 (4141, 16626.6),
 (3951, 16303.42),
 (3211, 16257.21),
 (3511, 15782.23),
 (3231, 15727.19),
 (2311, 15716.26),
 (1891, 15578.4),
 (1241, 15454.01),
 (1041, 15184.460000000001),
 (3351, 15177.8),
 (2451, 14875.19),
 (4501, 14629.16),
 (1971, 14482.599999999999),
 (3901, 13507.23),
 (3501, 13282.42),
 (2891, 13038.64),
 (1361, 12868.38),
 (1991, 11862.92),
 (3871, 11814.55),
 (2201, 11531.699999999999),
 (3731, 11501.84),
 (2221, 11243.630000000001),
 (3681, 10959.77),
 (1911, 10833.11),
 (2941, 10779.77),
 (4391, 10699.35),
 (1471, 10678.769999999999),
 (1271, 10667.46),
 (3931, 10555.349999999999),
 (1621, 10323.23),
 (4091, 10282.96),
 (3701, 10264.509999999998),
 (2791, 10212.060000000001),
 (4021, 10187.64),
 (3201, 10067.869999999999),
 (1071, 9995.05),
 (1481, 9980.929999999998),
 (4411, 9914.23),
 (3011, 9743.13),
 (3581, 9715.710000000001),
 (4481, 9618.810000000001),
 (2021, 9613.32),
 (3151, 9536.550000000001),
 (2401, 9339.199999999999),
 (2491, 8759.93),
 (3021, 8648.07),
 (1551, 8431.81),
 (3841, 8384.61),
 (1861, 8364.4),
 (2321, 8133.47),
 (1811, 7971.509999999999),
 (4121, 7940.370000000001),
 (1391, 7615.47),
 (1031, 7474.32),
 (3071, 7460.32),
 (2431, 7313.08),
 (1201, 7210.91),
 (3961, 7192.13),
 (3921, 6962.07),
 (3831, 6497.7),
 (4051, 6402.380000000001),
 (4331, 5739.630000000001),
 (4221, 5735.41),
 (2061, 5616.9),
 (2621, 5321.23),
 (3891, 5269.51),
 (3861, 4521.36),
 (1751, 3927.05),
 (1151, 3780.53),
 (3271, 3253.0400000000004),
 (3941, 3093.95),
 (4371, 3025.65),
 (4471, 2844.46),
 (1011, 2734.59),
 (3281, 2674.04),
 (4001, 2670.97),
 (3091, 2566.22),
 (1591, 2440.31),
 (2721, 2438.51),
 (3521, 2372.95),
 (1821, 2372.11),
 (2781, 2155.98),
 (4071, 2129.24),
 (4401, 1982.74),
 (3741, 1235.81),
 (3401, 1113.29),
 (3371, 1069.64),
 (1961, 1036.57),
 (4321, 881.73),
 (1671, 859.64),
 (1901, 390.25)]

## Having

In [97]:
## where does not work with aggregate functions

In [98]:
%%sql

SELECT account_id,
       SUM(total_amt_usd) AS sum_total_amt_usd
FROM orders
WHERE SUM(total_amt_usd) >= 250000
GROUP BY 1
ORDER BY 2 DESC

 * sqlite:///pandp.db
(sqlite3.OperationalError) misuse of aggregate: SUM()
[SQL: SELECT account_id,
       SUM(total_amt_usd) AS sum_total_amt_usd
FROM orders
WHERE SUM(total_amt_usd) >= 250000
GROUP BY 1
ORDER BY 2 DESC]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [99]:
%%sql
SELECT account_id,
       SUM(total_amt_usd) AS sum_total_amt_usd
FROM orders
GROUP BY 1
HAVING SUM(total_amt_usd) >= 250000

 * sqlite:///pandp.db
Done.

[(1301, 326819.48000000004),
 (1401, 272672.83999999997),
 (1561, 278575.63999999996),
 (1871, 300694.7899999999),
 (2181, 281018.36),
 (2541, 251299.77),
 (2591, 275288.30000000005),
 (2861, 253635.7500000001),
 (2931, 269155.33999999997),
 (3411, 291047.25000000006),
 (4111, 293861.14000000013),
 (4151, 345618.5900000001),
 (4211, 382873.3),
 (4251, 255319.18000000002)]

In [100]:
%%sql
SELECT s.id, s.name, COUNT(*) num_accounts
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.id, s.name
HAVING COUNT(*) > 5
ORDER BY num_accounts;

 * sqlite:///pandp.db
Done.

[(321500, 'Samuel Racine', 6),
 (321510, 'Eugena Esser', 6),
 (321560, 'Elba Felder', 6),
 (321580, 'Sibyl Lauria', 6),
 (321590, 'Necole Victory', 6),
 (321700, 'Debroah Wardle', 6),
 (321520, 'Michel Averette', 7),
 (321680, 'Elna Condello', 7),
 (321690, 'Gianna Dossey', 7),
 (321740, 'Charles Bidwell', 7),
 (321750, 'Cliff Meints', 7),
 (321870, 'Derrick Boggess', 7),
 (321880, 'Babette Soukup', 7),
 (321890, 'Nelle Meaux', 7),
 (321900, 'Soraya Fulton', 7),
 (321630, 'Julia Behrman', 8),
 (321640, 'Tia Amato', 8),
 (321760, 'Delilah Krum', 8),
 (321920, 'Marquetta Laycock', 9),
 (321950, 'Elwood Shutt', 9),
 (321990, 'Dawna Agnew', 9),
 (321810, 'Moon Torian', 10),
 (321860, 'Saran Ram', 10),
 (321910, 'Brandie Riva', 10),
 (321930, 'Hilma Busick', 10),
 (321940, 'Arica Stoltzfus', 10),
 (321800, 'Earlie Schleusner', 11),
 (321820, 'Dorotha Seawell', 11),
 (321830, 'Maren Musto', 11),
 (321840, 'Vernita Plump', 11),
 (321850, 'Calvin Ollison', 11),
 (321960, 'Maryanna Fiorentino', 11),
 (321980, 'Micha Woodford', 11),
 (321970, 'Georgianna Chisholm', 15)]

In [101]:
%%sql
SELECT COUNT(*) num_reps_above5
FROM(SELECT s.id, s.name, COUNT(*) num_accounts
     FROM accounts a
     JOIN sales_reps s
     ON s.id = a.sales_rep_id
     GROUP BY s.id, s.name
     HAVING COUNT(*) > 5
     ORDER BY num_accounts) AS Table1;

 * sqlite:///pandp.db
Done.

[(34,)]

In [102]:
%%sql

SELECT a.id, a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING COUNT(*) > 20
ORDER BY num_orders
limit 5;

 * sqlite:///pandp.db
Done.

[(1321, 'Anthem', 21),
 (2841, 'Performance Food Group', 21),
 (4171, 'Thrivent Financial for Lutherans', 21),
 (2191, 'Raytheon', 22),
 (2571, 'Jabil Circuit', 22)]

In [103]:
%%sql
SELECT a.id, a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY num_orders DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(3411, 'Leucadia National', 71)]

In [104]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) > 30000
ORDER BY total_spent
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(1661, 'American Airlines Group', 30083.18),
 (1431, 'PepsiCo', 30095.72),
 (3661, 'Group 1 Automotive', 30708.92),
 (1141, 'Costco', 30741.01),
 (1761, 'Oracle', 31231.559999999998)]

In [105]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) < 1000
ORDER BY total_spent;

 * sqlite:///pandp.db
Done.

[(1901, 'Nike', 390.25),
 (1671, 'Delta Air Lines', 859.64),
 (4321, 'Level 3 Communications', 881.73)]

In [106]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY total_spent DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(4211, 'EOG Resources', 382873.3)]

In [107]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY total_spent
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(1901, 'Nike', 390.25)]

In [108]:
%%sql
SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
HAVING COUNT(*) > 6 AND w.channel = 'facebook'
ORDER BY use_of_channel
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(1221, 'J.P. Morgan Chase', 'facebook', 7),
 (1261, 'Wells Fargo', 'facebook', 7),
 (1271, 'Home Depot', 'facebook', 7),
 (1701, 'Best Buy', 'facebook', 7),
 (1741, 'Honeywell International', 'facebook', 7)]

In [109]:
%%sql
SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE w.channel = 'facebook'
GROUP BY a.id, a.name, w.channel
ORDER BY use_of_channel DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(1851, 'Gilead Sciences', 'facebook', 16)]

In [110]:
%%sql
SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
ORDER BY use_of_channel DESC
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(3411, 'Leucadia National', 'direct', 52),
 (1601, 'New York Life Insurance', 'direct', 51),
 (2731, 'Colgate-Palmolive', 'direct', 51),
 (2051, 'Philip Morris International', 'direct', 49),
 (2351, 'AutoNation', 'direct', 48),
 (2871, 'FirstEnergy', 'direct', 48),
 (3471, 'ADP', 'direct', 48),
 (3491, 'BlackRock', 'direct', 48),
 (3911, 'Charter Communications', 'direct', 48),
 (1571, 'FedEx', 'direct', 47)]

## Date Functions

In [111]:
%%sql
SELECT occurred_at,
       SUM(standard_qty) AS standard_qty_sum
FROM orders
GROUP BY occurred_at
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[('2013-12-04 04:22:44', 0),
 ('2013-12-04 04:45:54', 490),
 ('2013-12-04 04:53:25', 528),
 ('2013-12-05 20:29:16', 0),
 ('2013-12-05 20:33:56', 492)]

In [112]:
%%sql
SELECT DATE_PART('dow',occurred_at) AS day_of_week,
       account_id,
       occurred_at,
       total
FROM orders

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_PART
[SQL: SELECT DATE_PART('dow',occurred_at) AS day_of_week,
       account_id,
       occurred_at,
       total
FROM orders]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [113]:
%%sql
SELECT DATE_PART('dow',occurred_at) AS day_of_week,
       SUM(total) AS total_qty
FROM orders
GROUP BY 1
ORDER BY 2

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_PART
[SQL: SELECT DATE_PART('dow',occurred_at) AS day_of_week,
       SUM(total) AS total_qty
FROM orders
GROUP BY 1
ORDER BY 2]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [114]:
%%sql
 SELECT DATE_PART('year', occurred_at) ord_year,  SUM(total_amt_usd) total_spent
 FROM orders
 GROUP BY 1
 ORDER BY 2 DESC;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_PART
[SQL: SELECT DATE_PART('year', occurred_at) ord_year,  SUM(total_amt_usd) total_spent
 FROM orders
 GROUP BY 1
 ORDER BY 2 DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Case

In [115]:
%%sql
SELECT account_id, CASE WHEN standard_qty = 0 OR standard_qty IS NULL THEN 0
                        ELSE standard_amt_usd/standard_qty END AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1001, 4.99),
 (1001, 4.99),
 (1001, 4.989999999999999),
 (1001, 4.989999999999999),
 (1001, 4.989999999999999),
 (1001, 4.99),
 (1001, 4.99),
 (1001, 4.99),
 (1001, 4.989999999999999),
 (1001, 4.99)]

In [116]:
%%sql
SELECT id,
       account_id,
       occurred_at,
       channel,
       CASE WHEN channel = 'facebook' THEN 'yes' END AS is_facebook
FROM web_events
ORDER BY occurred_at
limit 10;

 * sqlite:///pandp.db
Done.

[(2471, 2861, '2013-12-04 04:18:29', 'direct', None),
 (4193, 4311, '2013-12-04 04:44:58', 'direct', None),
 (8825, 4311, '2013-12-04 08:27:55', 'adwords', None),
 (6994, 2861, '2013-12-04 18:22:04', 'facebook', 'yes'),
 (294, 1281, '2013-12-05 20:17:50', 'direct', None),
 (4728, 1281, '2013-12-05 21:22:29', 'adwords', None),
 (1998, 2481, '2013-12-06 02:03:07', 'direct', None),
 (7587, 3251, '2013-12-06 07:52:09', 'organic', None),
 (6499, 2481, '2013-12-06 11:48:58', 'direct', None),
 (3186, 3431, '2013-12-06 12:31:12', 'direct', None)]

In [117]:
%%sql
SELECT id,
       account_id,
       occurred_at,
       channel,
       CASE WHEN channel = 'facebook' THEN 'yes' ELSE 'no' END AS is_facebook
FROM web_events
ORDER BY occurred_at
limit 10;

 * sqlite:///pandp.db
Done.

[(2471, 2861, '2013-12-04 04:18:29', 'direct', 'no'),
 (4193, 4311, '2013-12-04 04:44:58', 'direct', 'no'),
 (8825, 4311, '2013-12-04 08:27:55', 'adwords', 'no'),
 (6994, 2861, '2013-12-04 18:22:04', 'facebook', 'yes'),
 (294, 1281, '2013-12-05 20:17:50', 'direct', 'no'),
 (4728, 1281, '2013-12-05 21:22:29', 'adwords', 'no'),
 (1998, 2481, '2013-12-06 02:03:07', 'direct', 'no'),
 (7587, 3251, '2013-12-06 07:52:09', 'organic', 'no'),
 (6499, 2481, '2013-12-06 11:48:58', 'direct', 'no'),
 (3186, 3431, '2013-12-06 12:31:12', 'direct', 'no')]

In [118]:
%%sql
SELECT id,
       account_id,
       occurred_at,
       channel,
       CASE WHEN channel = 'facebook' OR channel = 'direct' THEN 'yes' 
       ELSE 'no' END AS is_facebook
FROM web_events
ORDER BY occurred_at
limit 10

 * sqlite:///pandp.db
Done.

[(2471, 2861, '2013-12-04 04:18:29', 'direct', 'yes'),
 (4193, 4311, '2013-12-04 04:44:58', 'direct', 'yes'),
 (8825, 4311, '2013-12-04 08:27:55', 'adwords', 'no'),
 (6994, 2861, '2013-12-04 18:22:04', 'facebook', 'yes'),
 (294, 1281, '2013-12-05 20:17:50', 'direct', 'yes'),
 (4728, 1281, '2013-12-05 21:22:29', 'adwords', 'no'),
 (1998, 2481, '2013-12-06 02:03:07', 'direct', 'yes'),
 (7587, 3251, '2013-12-06 07:52:09', 'organic', 'no'),
 (6499, 2481, '2013-12-06 11:48:58', 'direct', 'yes'),
 (3186, 3431, '2013-12-06 12:31:12', 'direct', 'yes')]

In [119]:
%%sql
SELECT account_id,
       occurred_at,
       total,
       CASE WHEN total > 500 THEN 'Over 500'
            WHEN total > 300 THEN '301 - 500'
            WHEN total > 100 THEN '101 - 300'
            ELSE '100 or under' END AS total_group
FROM orders
limit 10

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 169, '101 - 300'),
 (1001, '2015-11-05 03:34:33', 288, '101 - 300'),
 (1001, '2015-12-04 04:21:55', 132, '101 - 300'),
 (1001, '2016-01-02 01:18:24', 176, '101 - 300'),
 (1001, '2016-02-01 19:27:27', 165, '101 - 300'),
 (1001, '2016-03-02 15:29:32', 173, '101 - 300'),
 (1001, '2016-04-01 11:20:18', 226, '101 - 300'),
 (1001, '2016-05-01 15:55:51', 293, '101 - 300'),
 (1001, '2016-05-31 21:22:48', 129, '101 - 300'),
 (1001, '2016-06-30 12:32:05', 148, '101 - 300')]

In [120]:
%%sql
SELECT account_id,
       occurred_at,
       total,
       CASE WHEN total > 500 THEN 'Over 500'
            WHEN total > 300 AND total <= 500 THEN '301 - 500'
            WHEN total > 100 AND total <=300 THEN '101 - 300'
            ELSE '100 or under' END AS total_group
FROM orders
limit 10

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 169, '101 - 300'),
 (1001, '2015-11-05 03:34:33', 288, '101 - 300'),
 (1001, '2015-12-04 04:21:55', 132, '101 - 300'),
 (1001, '2016-01-02 01:18:24', 176, '101 - 300'),
 (1001, '2016-02-01 19:27:27', 165, '101 - 300'),
 (1001, '2016-03-02 15:29:32', 173, '101 - 300'),
 (1001, '2016-04-01 11:20:18', 226, '101 - 300'),
 (1001, '2016-05-01 15:55:51', 293, '101 - 300'),
 (1001, '2016-05-31 21:22:48', 129, '101 - 300'),
 (1001, '2016-06-30 12:32:05', 148, '101 - 300')]

In [121]:
%%sql
SELECT CASE WHEN total > 500 THEN 'OVer 500'
            ELSE '500 or under' END AS total_group,
            COUNT(*) AS order_count
FROM orders
GROUP BY 1

 * sqlite:///pandp.db
Done.

[('500 or under', 3716), ('OVer 500', 3196)]

In [122]:
%%sql
SELECT COUNT(1) AS orders_over_500_units
FROM orders
WHERE total > 500

 * sqlite:///pandp.db
Done.

[(3196,)]

In [123]:
%%sql
SELECT CASE WHEN total >= 2000 THEN 'At Least 2000'
WHEN total >= 1000 AND total < 2000 THEN 'Between 1000 and 2000'
ELSE 'Less than 1000' END AS order_category,
COUNT(*) AS order_count
FROM orders
GROUP BY 1;

 * sqlite:///pandp.db
Done.

[('At Least 2000', 70),
 ('Between 1000 and 2000', 511),
 ('Less than 1000', 6331)]

In [124]:
%%sql
SELECT a.name, SUM(total_amt_usd) total_spent, 
  CASE WHEN SUM(total_amt_usd) > 200000 THEN 'top'
  WHEN  SUM(total_amt_usd) > 100000 THEN 'middle'
  ELSE 'low' END AS customer_level
FROM orders o
JOIN accounts a
ON o.account_id = a.id 
GROUP BY a.name
ORDER BY 2 DESC
limit 10;

 * sqlite:///pandp.db
Done.

[('EOG Resources', 382873.3, 'top'),
 ('Mosaic', 345618.5900000001, 'top'),
 ('IBM', 326819.48000000004, 'top'),
 ('General Dynamics', 300694.7899999999, 'top'),
 ('Republic Services', 293861.14000000013, 'top'),
 ('Leucadia National', 291047.25000000006, 'top'),
 ('Arrow Electronics', 281018.36, 'top'),
 ('Sysco', 278575.63999999996, 'top'),
 ('Supervalu', 275288.30000000005, 'top'),
 ('Archer Daniels Midland', 272672.83999999997, 'top')]

In [125]:
%%sql
SELECT a.name, SUM(total_amt_usd) total_spent, 
  CASE WHEN SUM(total_amt_usd) > 200000 THEN 'top'
  WHEN  SUM(total_amt_usd) > 100000 THEN 'middle'
  ELSE 'low' END AS customer_level
FROM orders o
JOIN accounts a
ON o.account_id = a.id
WHERE occurred_at > '2015-12-31' 
GROUP BY 1
ORDER BY 2 DESC
limit 10;

 * sqlite:///pandp.db
Done.

[('Pacific Life', 255319.18000000002, 'top'),
 ('Mosaic', 172180.04, 'middle'),
 ('CHS', 163471.78, 'middle'),
 ('Core-Mark Holding', 148105.9299999999, 'middle'),
 ('Disney', 129157.37999999999, 'middle'),
 ('National Oilwell Varco', 121873.16, 'middle'),
 ('Sears Holdings', 114003.21000000002, 'middle'),
 ('State Farm Insurance Cos.', 111810.54999999999, 'middle'),
 ('Fidelity National Financial', 110027.29000000001, 'middle'),
 ('BB&T Corp.', 107300.05, 'middle')]

## Subquery

In [126]:
%%sql
SELECT channel,
       AVG(event_count) AS avg_event_count
FROM
(SELECT DATE_TRUNC('day',occurred_at) AS day,
        channel,
        count(*) as event_count
   FROM web_events
   GROUP BY 1,2
   ) sub
   GROUP BY 1
   ORDER BY 2 DESC

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: SELECT channel,
       AVG(event_count) AS avg_event_count
FROM
(SELECT DATE_TRUNC('day',occurred_at) AS day,
        channel,
        count(*) as event_count
   FROM web_events
   GROUP BY 1,2
   ) sub
   GROUP BY 1
   ORDER BY 2 DESC]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [127]:
%%sql
SELECT DATE_TRUNC('day',occurred_at) AS day,
       channel, COUNT(*) as events
FROM web_events
GROUP BY 1,2
ORDER BY 3 DESC;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: SELECT DATE_TRUNC('day',occurred_at) AS day,
       channel, COUNT(*) as events
FROM web_events
GROUP BY 1,2
ORDER BY 3 DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [128]:
%%sql
SELECT AVG(standard_qty) avg_std, AVG(gloss_qty) avg_gls, AVG(poster_qty) avg_pst
FROM orders
WHERE DATE_TRUNC('month', occurred_at) = 
     (SELECT DATE_TRUNC('month', MIN(occurred_at)) FROM orders);

SELECT SUM(total_amt_usd)
FROM orders
WHERE DATE_TRUNC('month', occurred_at) = 
      (SELECT DATE_TRUNC('month', MIN(occurred_at)) FROM orders);

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: SELECT AVG(standard_qty) avg_std, AVG(gloss_qty) avg_gls, AVG(poster_qty) avg_pst
FROM orders
WHERE DATE_TRUNC('month', occurred_at) =
     (SELECT DATE_TRUNC('month', MIN(occurred_at)) FROM orders);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## views

In [129]:
%%sql
CREATE VIEW V3
AS
SELECT channel, AVG(events) AS average_events
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
                channel, COUNT(*) as events
         FROM web_events 
         GROUP BY 1,2) sub
GROUP BY channel

 * sqlite:///pandp.db
(sqlite3.OperationalError) view V3 already exists
[SQL: CREATE VIEW V3
AS
SELECT channel, AVG(events) AS average_events
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
                channel, COUNT(*) as events
         FROM web_events
         GROUP BY 1,2) sub
GROUP BY channel]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [130]:
%%sql
select max(average_events)
from v3;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: select max(average_events)
from v3;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [131]:
%%sql
SELECT accounts.name, web_events.channel, Count(*)
FROM accounts
JOIN web_events ON accounts.id = Web_events.account_id
GROUP BY 1, 2
ORDER BY 1,3
limit 5;

 * sqlite:///pandp.db
Done.

[('3M', 'adwords', 2),
 ('3M', 'facebook', 2),
 ('3M', 'direct', 19),
 ('ADP', 'twitter', 3),
 ('ADP', 'banner', 6)]

In [132]:
%%sql
SELECT T1.name, Max(T1.count)
FROM (
       SELECT accounts.name as name, web_events.channel as channel, Count(*) as count
       FROM accounts
       JOIN web_events ON accounts.id = Web_events.account_id
       GROUP BY 1, 2
       ORDER BY 1,3
) as T1
GROUP BY 1
limit 5

 * sqlite:///pandp.db
Done.

[('3M', 19), ('ADP', 48), ('AECOM', 8), ('AES', 2), ('AIG', 1)]

In [133]:
%%sql
SELECT a.id, a.name, we.channel, COUNT(*) ct
FROM accounts a
JOIN web_events we
ON a.id = we.account_id
GROUP BY a.id, a.name, we.channel
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'adwords', 5),
 (1001, 'Walmart', 'banner', 3),
 (1001, 'Walmart', 'direct', 22),
 (1001, 'Walmart', 'facebook', 2),
 (1001, 'Walmart', 'organic', 6)]

In [134]:
%%sql
SELECT a.id, a.name, we.channel, COUNT(*) ct
FROM accounts a
JOIN web_events we
ON a.id = we.account_id
GROUP BY a.id, a.name, we.channel
ORDER BY a.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'adwords', 5),
 (1001, 'Walmart', 'banner', 3),
 (1001, 'Walmart', 'direct', 22),
 (1001, 'Walmart', 'facebook', 2),
 (1001, 'Walmart', 'organic', 6)]

In [135]:
%%sql
SELECT t1.id, t1.name, MAX(ct)
FROM (SELECT a.id, a.name, we.channel, COUNT(*) ct
     FROM accounts a
     JOIN web_events we
     On a.id = we.account_id
     GROUP BY a.id, a.name, we.channel) T1
GROUP BY t1.id, t1.name
limit 10;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 22),
 (1011, 'Exxon Mobil', 1),
 (1021, 'Apple', 9),
 (1031, 'Berkshire Hathaway', 1),
 (1041, 'McKesson', 5),
 (1051, 'UnitedHealth Group', 9),
 (1061, 'CVS Health', 4),
 (1071, 'General Motors', 1),
 (1081, 'Ford Motor', 29),
 (1091, 'AT&T', 35)]

In [136]:
%%sql
SELECT t3.id, t3.name, t3.channel, t3.ct
FROM (SELECT a.id, a.name, we.channel, COUNT(*) ct
     FROM accounts a
     JOIN web_events we
     On a.id = we.account_id
     GROUP BY a.id, a.name, we.channel) T3
JOIN (SELECT t1.id, t1.name, MAX(ct) max_chan
      FROM (SELECT a.id, a.name, we.channel, COUNT(*) ct
            FROM accounts a
            JOIN web_events we
            ON a.id = we.account_id
            GROUP BY a.id, a.name, we.channel) t1
      GROUP BY t1.id, t1.name) t2
ON t2.id = t3.id AND t2.max_chan = t3.ct
ORDER BY t3.id
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'direct', 22),
 (1011, 'Exxon Mobil', 'adwords', 1),
 (1011, 'Exxon Mobil', 'direct', 1),
 (1011, 'Exxon Mobil', 'facebook', 1),
 (1021, 'Apple', 'direct', 9)]

In [137]:
%%sql
SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY 1,2
ORDER BY 3 DESC
LIMIT 5;

 * sqlite:///pandp.db
Done.

[('Earlie Schleusner', 'Southeast', 1098137.7199999997),
 ('Tia Amato', 'Northeast', 1010690.6000000003),
 ('Vernita Plump', 'Southeast', 934212.9299999998),
 ('Georgianna Chisholm', 'West', 886244.1200000002),
 ('Arica Stoltzfus', 'West', 810353.3399999999)]

In [138]:
%%sql
SELECT region_name, MAX(total_amt) total_amt
     FROM(SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY 1, 2) t1
     GROUP BY 1;

 * sqlite:///pandp.db
Done.

[('Midwest', 675637.1899999998),
 ('Northeast', 1010690.6000000003),
 ('Southeast', 1098137.7199999997),
 ('West', 886244.1200000002)]

In [139]:
%%sql
SELECT t3.rep_name, t3.region_name, t3.total_amt
FROM(SELECT region_name, MAX(total_amt) total_amt
     FROM(SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY 1, 2) t1
     GROUP BY 1) t2
JOIN (SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
     FROM sales_reps s
     JOIN accounts a
     ON a.sales_rep_id = s.id
     JOIN orders o
     ON o.account_id = a.id
     JOIN region r
     ON r.id = s.region_id
     GROUP BY 1,2
     ORDER BY 3 DESC) t3
ON t3.region_name = t2.region_name AND t3.total_amt = t2.total_amt;

 * sqlite:///pandp.db
Done.

[('Charles Bidwell', 'Midwest', 675637.1899999998),
 ('Tia Amato', 'Northeast', 1010690.6000000003),
 ('Earlie Schleusner', 'Southeast', 1098137.7199999997),
 ('Georgianna Chisholm', 'West', 886244.1200000002)]

In [140]:
%%sql
SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY r.name;

 * sqlite:///pandp.db
Done.

[('Midwest', 3013486.509999998),
 ('Northeast', 7744405.359999996),
 ('Southeast', 6458496.999999998),
 ('West', 5925122.959999999)]

In [141]:
%%sql
SELECT MAX(total_amt)
FROM (SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY r.name) sub;

 * sqlite:///pandp.db
Done.

[(7744405.359999996,)]

In [142]:
%%sql
SELECT r.name, COUNT(o.total) total_orders
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY r.name
HAVING SUM(o.total_amt_usd) = (
      SELECT MAX(total_amt)
      FROM (SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
              FROM sales_reps s
              JOIN accounts a
              ON a.sales_rep_id = s.id
              JOIN orders o
              ON o.account_id = a.id
              JOIN region r
              ON r.id = s.region_id
              GROUP BY r.name) sub);

 * sqlite:///pandp.db
Done.

[('Northeast', 2357)]

In [143]:
%%sql
SELECT a.name account_name, SUM(o.standard_qty) total_std, SUM(o.total) total
FROM accounts a
JOIN orders o
ON o.account_id = a.id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('Core-Mark Holding', 41617, 44750)]

In [144]:
%%sql
SELECT a.name
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY 1
HAVING SUM(o.total) > (SELECT total 
                   FROM (SELECT a.name act_name, SUM(o.standard_qty) tot_std, SUM(o.total) total
                         FROM accounts a
                         JOIN orders o
                         ON o.account_id = a.id
                         GROUP BY 1
                         ORDER BY 2 DESC
                         LIMIT 1) sub);

 * sqlite:///pandp.db
Done.

[('EOG Resources',), ('IBM',), ('Mosaic',)]

In [145]:
%%sql
SELECT COUNT(*)
FROM (SELECT a.name
       FROM orders o
       JOIN accounts a
       ON a.id = o.account_id
       GROUP BY 1
       HAVING SUM(o.total) > (SELECT total 
                   FROM (SELECT a.name act_name, SUM(o.standard_qty) tot_std, SUM(o.total) total
                         FROM accounts a
                         JOIN orders o
                         ON o.account_id = a.id
                         GROUP BY 1
                         ORDER BY 2 DESC
                         LIMIT 1) inner_tab)
             ) counter_tab;

 * sqlite:///pandp.db
Done.

[(3,)]

In [146]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY 3 DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(4211, 'EOG Resources', 382873.3)]

In [147]:
%%sql
SELECT a.name, w.channel, COUNT(*)
FROM accounts a
JOIN web_events w
ON a.id = w.account_id AND a.id =  (SELECT id
                     FROM (SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
                           FROM orders o
                           JOIN accounts a
                           ON a.id = o.account_id
                           GROUP BY a.id, a.name
                           ORDER BY 3 DESC
                           LIMIT 1) inner_table)
GROUP BY 1, 2
ORDER BY 3 DESC;

 * sqlite:///pandp.db
Done.

[('EOG Resources', 'direct', 44),
 ('EOG Resources', 'organic', 13),
 ('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'twitter', 5),
 ('EOG Resources', 'banner', 4)]

In [148]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY 3 DESC
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(4211, 'EOG Resources', 382873.3),
 (4151, 'Mosaic', 345618.5900000001),
 (1301, 'IBM', 326819.48000000004),
 (1871, 'General Dynamics', 300694.7899999999),
 (4111, 'Republic Services', 293861.14000000013),
 (3411, 'Leucadia National', 291047.25000000006),
 (2181, 'Arrow Electronics', 281018.36),
 (1561, 'Sysco', 278575.63999999996),
 (2591, 'Supervalu', 275288.30000000005),
 (1401, 'Archer Daniels Midland', 272672.83999999997)]

In [149]:
%%sql
SELECT AVG(tot_spent)
FROM (SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
      FROM orders o
      JOIN accounts a
      ON a.id = o.account_id
      GROUP BY a.id, a.name
      ORDER BY 3 DESC
       LIMIT 10) temp;

 * sqlite:///pandp.db
Done.

[(304846.96900000004,)]

In [150]:
%%sql
SELECT o.account_id, AVG(o.total_amt_usd)
FROM orders o
GROUP BY 1
HAVING AVG(o.total_amt_usd) > (SELECT AVG(o.total_amt_usd) avg_all
                               FROM orders o)
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 4429.1025),
 (1031, 7474.32),
 (1061, 3944.5849999999996),
 (1071, 4997.525),
 (1081, 4184.092702702702)]

In [151]:
%%sql SELECT AVG(avg_amt)
FROM (SELECT o.account_id, AVG(o.total_amt_usd) avg_amt
    FROM orders o
    GROUP BY 1
    HAVING AVG(o.total_amt_usd) > (SELECT AVG(o.total_amt_usd) avg_all
                                   FROM orders o)) temp_table;

 * sqlite:///pandp.db
Done.

[(4721.139743997174,)]

In [152]:
%%sql
SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY 1,2
ORDER BY 3 DESC
limit 5;

 * sqlite:///pandp.db
Done.

[('Earlie Schleusner', 'Southeast', 1098137.7199999997),
 ('Tia Amato', 'Northeast', 1010690.6000000003),
 ('Vernita Plump', 'Southeast', 934212.9299999998),
 ('Georgianna Chisholm', 'West', 886244.1200000002),
 ('Arica Stoltzfus', 'West', 810353.3399999999)]

In [153]:
%%sql
SELECT region_name, MAX(total_amt) total_amt
     FROM(SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY 1, 2) t1
     GROUP BY 1;

 * sqlite:///pandp.db
Done.

[('Midwest', 675637.1899999998),
 ('Northeast', 1010690.6000000003),
 ('Southeast', 1098137.7199999997),
 ('West', 886244.1200000002)]

In [154]:
%%sql
SELECT t3.rep_name, t3.region_name, t3.total_amt
FROM(SELECT region_name, MAX(total_amt) total_amt
     FROM(SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY 1, 2) t1
     GROUP BY 1) t2
JOIN (SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
     FROM sales_reps s
     JOIN accounts a
     ON a.sales_rep_id = s.id
     JOIN orders o
     ON o.account_id = a.id
     JOIN region r
     ON r.id = s.region_id
     GROUP BY 1,2
     ORDER BY 3 DESC) t3
ON t3.region_name = t2.region_name AND t3.total_amt = t2.total_amt;

 * sqlite:///pandp.db
Done.

[('Charles Bidwell', 'Midwest', 675637.1899999998),
 ('Tia Amato', 'Northeast', 1010690.6000000003),
 ('Earlie Schleusner', 'Southeast', 1098137.7199999997),
 ('Georgianna Chisholm', 'West', 886244.1200000002)]

In [157]:
%%sql 
SELECT MAX(total_amt)
FROM (SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
             FROM sales_reps s
             JOIN accounts a
             ON a.sales_rep_id = s.id
             JOIN orders o
             ON o.account_id = a.id
             JOIN region r
             ON r.id = s.region_id
             GROUP BY r.name) sub;

 * sqlite:///pandp.db
Done.

[(7744405.359999996,)]

In [158]:
%%sql
SELECT r.name, COUNT(o.total) total_orders
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY r.name
HAVING SUM(o.total_amt_usd) = (
      SELECT MAX(total_amt)
      FROM (SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
              FROM sales_reps s
              JOIN accounts a
              ON a.sales_rep_id = s.id
              JOIN orders o
              ON o.account_id = a.id
              JOIN region r
              ON r.id = s.region_id
              GROUP BY r.name) sub);

 * sqlite:///pandp.db
Done.

[('Northeast', 2357)]

In [159]:
%%sql
SELECT a.name account_name, SUM(o.standard_qty) total_std, SUM(o.total) total
FROM accounts a
JOIN orders o
ON o.account_id = a.id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[('Core-Mark Holding', 41617, 44750)]

In [160]:
%%sql
SELECT a.name
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY 1
HAVING SUM(o.total) > (SELECT total 
                   FROM (SELECT a.name act_name, SUM(o.standard_qty) tot_std, SUM(o.total) total
                         FROM accounts a
                         JOIN orders o
                         ON o.account_id = a.id
                         GROUP BY 1
                         ORDER BY 2 DESC
                         LIMIT 1) sub);

 * sqlite:///pandp.db
Done.

[('EOG Resources',), ('IBM',), ('Mosaic',)]

In [161]:
%%sql
SELECT COUNT(*)
FROM (SELECT a.name
       FROM orders o
       JOIN accounts a
       ON a.id = o.account_id
       GROUP BY 1
       HAVING SUM(o.total) > (SELECT total 
                   FROM (SELECT a.name act_name, SUM(o.standard_qty) tot_std, SUM(o.total) total
                         FROM accounts a
                         JOIN orders o
                         ON o.account_id = a.id
                         GROUP BY 1
                         ORDER BY 2 DESC
                         LIMIT 1) inner_tab)
             ) counter_tab;

 * sqlite:///pandp.db
Done.

[(3,)]

In [162]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY 3 DESC
LIMIT 1;

 * sqlite:///pandp.db
Done.

[(4211, 'EOG Resources', 382873.3)]

In [163]:
%%sql
SELECT a.name, w.channel, COUNT(*)
FROM accounts a
JOIN web_events w
ON a.id = w.account_id AND a.id =  (SELECT id
                     FROM (SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
                           FROM orders o
                           JOIN accounts a
                           ON a.id = o.account_id
                           GROUP BY a.id, a.name
                           ORDER BY 3 DESC
                           LIMIT 1) inner_table)
GROUP BY 1, 2
ORDER BY 3 DESC;

 * sqlite:///pandp.db
Done.

[('EOG Resources', 'direct', 44),
 ('EOG Resources', 'organic', 13),
 ('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'twitter', 5),
 ('EOG Resources', 'banner', 4)]

In [164]:
%%sql
SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
FROM orders o
JOIN accounts a
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY 3 DESC
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(4211, 'EOG Resources', 382873.3),
 (4151, 'Mosaic', 345618.5900000001),
 (1301, 'IBM', 326819.48000000004),
 (1871, 'General Dynamics', 300694.7899999999),
 (4111, 'Republic Services', 293861.14000000013),
 (3411, 'Leucadia National', 291047.25000000006),
 (2181, 'Arrow Electronics', 281018.36),
 (1561, 'Sysco', 278575.63999999996),
 (2591, 'Supervalu', 275288.30000000005),
 (1401, 'Archer Daniels Midland', 272672.83999999997)]

In [165]:
%%sql
SELECT AVG(tot_spent)
FROM (SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
      FROM orders o
      JOIN accounts a
      ON a.id = o.account_id
      GROUP BY a.id, a.name
      ORDER BY 3 DESC
       LIMIT 10) temp;

 * sqlite:///pandp.db
Done.

[(304846.96900000004,)]

In [167]:
%%sql
SELECT o.account_id, AVG(o.total_amt_usd)
FROM orders o
GROUP BY 1
HAVING AVG(o.total_amt_usd) > (SELECT AVG(o.total_amt_usd) avg_all
                               FROM orders o)
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, 4429.1025),
 (1031, 7474.32),
 (1061, 3944.5849999999996),
 (1071, 4997.525),
 (1081, 4184.092702702702)]

In [168]:
%%sql
SELECT AVG(avg_amt)
FROM (SELECT o.account_id, AVG(o.total_amt_usd) avg_amt
    FROM orders o
    GROUP BY 1
    HAVING AVG(o.total_amt_usd) > (SELECT AVG(o.total_amt_usd) avg_all
                                   FROM orders o)) temp_table;

 * sqlite:///pandp.db
Done.

[(4721.139743997174,)]

## CTE

In [171]:
%%sql

SELECT channel, AVG(events) AS average_events
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
             channel, COUNT(*) as events
      FROM web_events 
      GROUP BY 1,2) sub
GROUP BY channel
ORDER BY 2 DESC;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: SELECT channel, AVG(events) AS average_events
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
             channel, COUNT(*) as events
      FROM web_events
      GROUP BY 1,2) sub
GROUP BY channel
ORDER BY 2 DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [173]:
%%sql
WITH events AS (
          SELECT DATE_TRUNC('day',occurred_at) AS day, 
                        channel, COUNT(*) as events
          FROM web_events 
          GROUP BY 1,2)

 * sqlite:///pandp.db
(sqlite3.OperationalError) incomplete input
[SQL: WITH events AS (
          SELECT DATE_TRUNC('day',occurred_at) AS day,
                        channel, COUNT(*) as events
          FROM web_events
          GROUP BY 1,2)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [174]:
%%sql
WITH events AS (
          SELECT DATE_TRUNC('day',occurred_at) AS day, 
                        channel, COUNT(*) as events
          FROM web_events 
          GROUP BY 1,2)

SELECT channel, AVG(events) AS average_events
FROM events
GROUP BY channel
ORDER BY 2 DESC;

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such function: DATE_TRUNC
[SQL: WITH events AS (
          SELECT DATE_TRUNC('day',occurred_at) AS day,
                        channel, COUNT(*) as events
          FROM web_events
          GROUP BY 1,2)

SELECT channel, AVG(events) AS average_events
FROM events
GROUP BY channel
ORDER BY 2 DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [176]:
%%sql
WITH table1 AS (
          SELECT *
          FROM web_events),

     table2 AS (
          SELECT *
          FROM accounts)


SELECT *
FROM table1
JOIN table2
ON table1.account_id = table2.id
limit 6;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:13:58', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (2, 1001, '2015-11-05 03:08:26', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (3, 1001, '2015-12-04 03:57:24', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (4, 1001, '2016-01-02 00:55:03', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (5, 1001, '2016-02-01 19:02:33', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (6, 1001, '2016-03-02 15:15:22', 'direct', 1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)]

In [177]:
%%sql
WITH t1 AS (
  SELECT s.name rep_name, r.name region_name, SUM(o.total_amt_usd) total_amt
   FROM sales_reps s
   JOIN accounts a
   ON a.sales_rep_id = s.id
   JOIN orders o
   ON o.account_id = a.id
   JOIN region r
   ON r.id = s.region_id
   GROUP BY 1,2
   ORDER BY 3 DESC), 
t2 AS (
   SELECT region_name, MAX(total_amt) total_amt
   FROM t1
   GROUP BY 1)
SELECT t1.rep_name, t1.region_name, t1.total_amt
FROM t1
JOIN t2
ON t1.region_name = t2.region_name AND t1.total_amt = t2.total_amt;

 * sqlite:///pandp.db
Done.

[('Earlie Schleusner', 'Southeast', 1098137.7199999997),
 ('Tia Amato', 'Northeast', 1010690.6000000003),
 ('Georgianna Chisholm', 'West', 886244.1200000002),
 ('Charles Bidwell', 'Midwest', 675637.1899999998)]

In [178]:
%%sql
WITH t1 AS (
   SELECT r.name region_name, SUM(o.total_amt_usd) total_amt
   FROM sales_reps s
   JOIN accounts a
   ON a.sales_rep_id = s.id
   JOIN orders o
   ON o.account_id = a.id
   JOIN region r
   ON r.id = s.region_id
   GROUP BY r.name), 
t2 AS (
   SELECT MAX(total_amt)
   FROM t1)
SELECT r.name, COUNT(o.total) total_orders
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
JOIN region r
ON r.id = s.region_id
GROUP BY r.name
HAVING SUM(o.total_amt_usd) = (SELECT * FROM t2);

 * sqlite:///pandp.db
Done.

[('Northeast', 2357)]

In [179]:
%%sql
WITH t1 AS (
  SELECT a.name account_name, SUM(o.standard_qty) total_std, SUM(o.total) total
  FROM accounts a
  JOIN orders o
  ON o.account_id = a.id
  GROUP BY 1
  ORDER BY 2 DESC
  LIMIT 1), 
t2 AS (
  SELECT a.name
  FROM orders o
  JOIN accounts a
  ON a.id = o.account_id
  GROUP BY 1
  HAVING SUM(o.total) > (SELECT total FROM t1))
SELECT COUNT(*)
FROM t2;

 * sqlite:///pandp.db
Done.

[(3,)]

In [180]:
%%sql
WITH t1 AS (
   SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
   FROM orders o
   JOIN accounts a
   ON a.id = o.account_id
   GROUP BY a.id, a.name
   ORDER BY 3 DESC
   LIMIT 1)
SELECT a.name, w.channel, COUNT(*)
FROM accounts a
JOIN web_events w
ON a.id = w.account_id AND a.id =  (SELECT id FROM t1)
GROUP BY 1, 2
ORDER BY 3 DESC;

 * sqlite:///pandp.db
Done.

[('EOG Resources', 'direct', 44),
 ('EOG Resources', 'organic', 13),
 ('EOG Resources', 'adwords', 12),
 ('EOG Resources', 'facebook', 11),
 ('EOG Resources', 'twitter', 5),
 ('EOG Resources', 'banner', 4)]

In [181]:
%%sql
WITH t1 AS (
   SELECT a.id, a.name, SUM(o.total_amt_usd) tot_spent
   FROM orders o
   JOIN accounts a
   ON a.id = o.account_id
   GROUP BY a.id, a.name
   ORDER BY 3 DESC
   LIMIT 10)
SELECT AVG(tot_spent)
FROM t1;

 * sqlite:///pandp.db
Done.

[(304846.96900000004,)]

In [182]:
%%sql
WITH t1 AS (
   SELECT AVG(o.total_amt_usd) avg_all
   FROM orders o
   JOIN accounts a
   ON a.id = o.account_id),
t2 AS (
   SELECT o.account_id, AVG(o.total_amt_usd) avg_amt
   FROM orders o
   GROUP BY 1
   HAVING AVG(o.total_amt_usd) > (SELECT * FROM t1))
SELECT AVG(avg_amt)
FROM t2;

 * sqlite:///pandp.db
Done.

[(4721.139743997174,)]

In [183]:
%%sql
SELECT *
FROM students
WHERE student_id
IN (SELECT DISTINCT student_id
    FROM gpa_table
    WHERE gpa>3.5
    );

 * sqlite:///pandp.db
(sqlite3.OperationalError) no such table: students
[SQL: SELECT *
FROM students
WHERE student_id
IN (SELECT DISTINCT student_id
    FROM gpa_table
    WHERE gpa>3.5
    );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [184]:
%%sql
SELECT dept_name,
       max_gpa
FROM department_db x
     (SELECT dept_id
             MAX(gpa) as max_gpa
      FROM students
      GROUP BY dept_id
      )y
WHERE x.dept_id = y.dept_id
ORDER BY dept_name;

 * sqlite:///pandp.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: SELECT dept_name,
       max_gpa
FROM department_db x
     (SELECT dept_id
             MAX(gpa) as max_gpa
      FROM students
      GROUP BY dept_id
      )y
WHERE x.dept_id = y.dept_id
ORDER BY dept_name;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)